
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>开始领域驱动设计 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="strategic-modeling.html" />
    
    
    <link rel="prev" href="../" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    README简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../">
            
                <a href="../">
            
                    
                    DDD领域驱动设计
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.2.1" data-path="start-domain-drive-design.html">
            
                <a href="start-domain-drive-design.html">
            
                    
                    开始领域驱动设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="strategic-modeling.html">
            
                <a href="strategic-modeling.html">
            
                    
                    战略建模
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="architecture.html">
            
                <a href="architecture.html">
            
                    
                    架构设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="tactical-modeling.html">
            
                <a href="tactical-modeling.html">
            
                    
                    战术建模
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >开始领域驱动设计</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h4 id="&#x521D;&#x8BC6;&#x9886;&#x57DF;&#x9A71;&#x52A8;&#x8BBE;&#x8BA1;">&#x521D;&#x8BC6;&#x9886;&#x57DF;&#x9A71;&#x52A8;&#x8BBE;&#x8BA1;</h4>
<p>&#x5728;&#x6CA1;&#x6709;&#x4E86;&#x89E3;&#x9886;&#x57DF;&#x9A71;&#x52A8;&#x8BBE;&#x8BA1;&#x4E4B;&#x524D;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x4E1A;&#x52A1;&#x5F00;&#x53D1;&#x7684;&#x5DE5;&#x4F5C;&#x53EF;&#x80FD;&#x5C31;&#x662F;&#x5E38;&#x89C1;&#x7684;<code>CRUD</code>&#x3002;</p>
<p>&#x57FA;&#x672C;&#x4EE3;&#x7801;&#x6B65;&#x9AA4;&#x53EF;&#x80FD;&#x5C31;&#x662F;&#xFF1A;&#x63A5;&#x53D7;&#x8BF7;&#x6C42;-&gt;&#x8BF7;&#x6C42;&#x4E0B;&#x6E38;RPC-&gt;&#x5904;&#x7406;&#x540E;&#x8FD4;&#x56DE;&#x3002;</p>
<p>&#x8FD9;&#x57FA;&#x672C;&#x662F;&#x4E00;&#x4E2A;&#x7EAF;&#x9762;&#x5411;&#x8FC7;&#x7A0B;&#x5F0F;&#x7684;&#x4EE3;&#x7801;&#x98CE;&#x683C;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x591A;&#x5E74;&#x4E1A;&#x52A1;&#x5F00;&#x53D1;&#x7ECF;&#x9A8C;&#x7684;&#x8BDD;&#xFF0C;&#x5E94;&#x8BE5;&#x77E5;&#x9053;&#x8FD9;&#x91CC;&#x6700;&#x5927;&#x7684;&#x95EE;&#x9898;&#x662F;&#x4EE3;&#x7801;&#x91CD;&#x590D;&#x7387;&#x9AD8;&#x3001;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x5DEE;&#xFF0C;&#x56E0;&#x4E3A;&#x5927;&#x91CF;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x6563;&#x843D;&#x5728;&#x5404;&#x4E2A;&#x5730;&#x65B9;&#x4E86;&#x3002;</p>
<p>&#x800C;&#x8FD9;&#x79CD;&#x9762;&#x5411;&#x8FC7;&#x7A0B;&#x5F0F;&#x7684;&#x4EE3;&#x7801;&#x98CE;&#x683C;&#x4E5F;&#x5F88;&#x5BB9;&#x6613;&#x5BFC;&#x81F4;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x9762;&#x5411;&#x6570;&#x636E;&#x5E93;&#x7F16;&#x7A0B;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x56DE;&#x5FC6;&#x4E00;&#x4E0B;&#xFF0C;&#x5728;&#x505A;&#x9700;&#x6C42;&#x8BBE;&#x8BA1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x7B2C;&#x4E00;&#x4E2A;&#x60F3;&#x6CD5;&#x5C31;&#x662F;&#x5148;&#x628A;&#x6570;&#x636E;&#x5E93;&#x7269;&#x7406;&#x6A21;&#x578B;&#x5148;&#x8BBE;&#x8BA1;&#x51FA;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x57FA;&#x4E8E;&#x8FD9;&#x4E2A;&#x7269;&#x7406;&#x6A21;&#x578B;&#x53BB;&#x5B9E;&#x73B0;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x3002;</p>
<p>&#x800C;&#x5728;<code>&#x9886;&#x57DF;&#x9A71;&#x52A8;&#x8BBE;&#x8BA1;</code>&#x91CC;&#x9762;&#xFF0C;&#x8BBE;&#x8BA1;&#x7269;&#x7406;&#x6A21;&#x578B;&#x5E76;&#x4E0D;&#x662F;&#x6700;&#x9AD8;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x9886;&#x57DF;&#x9A71;&#x52A8;&#x8BBE;&#x8BA1;&#x66F4;&#x52A0;&#x5173;&#x6CE8;<code>&#x4E1A;&#x52A1;&#x672C;&#x8EAB;&#x903B;&#x8F91;&#x7684;&#x8BBE;&#x8BA1;</code>&#xFF0C;&#x56E0;&#x6B64;&#x9886;&#x57DF;&#x9A71;&#x52A8;&#x8BBE;&#x8BA1;&#x91CC;&#x9762;&#x6709;&#x8BF8;&#x5982;<code>&#x6218;&#x7565;&#x5EFA;&#x6A21;</code>&#x3001;<code>&#x6218;&#x672F;&#x5EFA;&#x6A21;</code>&#x3001;<code>&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;</code>&#x3001;<code>&#x901A;&#x7528;&#x8BED;&#x8A00;</code>&#x3001;<code>&#x4E0A;&#x4E0B;&#x6587;&#x6620;&#x5C04;&#x56FE;</code>&#x3001;<code>&#x9886;&#x57DF;</code>&#x3001;<code>&#x5B50;&#x57DF;</code>&#x3001;<code>&#x805A;&#x5408;</code>&#x3001;<code>&#x5B9E;&#x4F53;</code>&#x3001;<code>&#x503C;&#x5BF9;&#x8C61;</code>&#x3001;<code>&#x9886;&#x57DF;&#x670D;&#x52A1;</code>&#x7B49;&#x6982;&#x5FF5;&#x3002;</p>
<p>&#x4E00;&#x53E5;&#x8BDD;&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x5E0C;&#x671B;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#x4E0D;&#x603B;&#x662F;<code>CRUD</code>&#xFF0C;&#x60F3;&#x5F00;&#x53D1;&#x51FA;&#x4F18;&#x96C5;&#x6574;&#x6D01;&#x53EF;&#x5FEB;&#x901F;&#x8FED;&#x4EE3;&#x7684;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#xFF0C;&#x90A3;&#x4E48;&#x5F00;&#x59CB;&#x5B66;&#x9886;&#x57DF;&#x9A71;&#x52A8;&#x8BBE;&#x8BA1;&#x80AF;&#x5B9A;&#x4E0D;&#x4F1A;&#x8BA9;&#x4F60;&#x5931;&#x671B;&#x7684;&#xFF0C;&#x9886;&#x57DF;&#x9A71;&#x52A8;&#x8BBE;&#x8BA1;&#x4E5F;&#x53EF;&#x4EE5;&#x5E2E;&#x4F60;&#x4ECE;&#x66F4;&#x9AD8;&#x7684;&#x9AD8;&#x5EA6;&#x53BB;&#x601D;&#x8003;&#x4E1A;&#x52A1;&#x3002;</p>
<h4 id="&#x6218;&#x7565;&#x5EFA;&#x6A21;strategic-modeling">&#x6218;&#x7565;&#x5EFA;&#x6A21;(Strategic Modeling)</h4>
<p>&#x6218;&#x7565;&#x5EFA;&#x6A21;&#x4E3B;&#x8981;&#x5305;&#x62EC;&#x8BBE;&#x8BA1;<code>&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;</code>&#x3001;<code>&#x901A;&#x7528;&#x8BED;&#x8A00;</code>&#x3001;<code>&#x4E0A;&#x4E0B;&#x6587;&#x6620;&#x5C04;&#x56FE;</code>&#xFF0C;&#x7528;&#x4E8E;&#x5E2E;&#x52A9;&#x7406;&#x6E05;&#x4E1A;&#x52A1;&#x91CD;&#x8981;&#x7A0B;&#x5EA6;&#x548C;&#x54EA;&#x4E9B;&#x8F6F;&#x4EF6;&#x8D44;&#x4EA7;&#x662F;&#x53EF;&#x91CD;&#x65B0;&#x62FF;&#x6765;&#x4F7F;&#x7528;&#x7684;&#x3002;</p>
<p>&#x4E0B;&#x56FE;&#x662F;&#x300A;&#x5B9E;&#x73B0;&#x9886;&#x57DF;&#x9A71;&#x52A8;&#x8BBE;&#x8BA1;&#x300B;&#x4E00;&#x4E66;&#x7684;<code>&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;</code>&#x548C;<code>&#x901A;&#x7528;&#x8BED;&#x8A00;</code>&#x4E00;&#x5F20;&#x793A;&#x610F;&#x56FE;&#xFF1A;</p>
<p><img src="images/bounded-context-and-relevant-ubiquitous-language.PNG" alt="&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x548C;&#x901A;&#x7528;&#x8BED;&#x8A00;"></p>
<p><code>&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;</code>&#x662F;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x7684;&#x8FB9;&#x754C;&#xFF0C;&#x8FB9;&#x754C;&#x5185;&#x7684;<code>&#x901A;&#x7528;&#x8BED;&#x8A00;</code>&#x662F;&#x6E05;&#x6670;&#x5355;&#x4E00;&#x65E0;&#x6B67;&#x4E49;&#x7684;&#x3002;</p>
<p>&#x5728;&#x300A;&#x5B9E;&#x73B0;&#x9886;&#x57DF;&#x9A71;&#x52A8;&#x8BBE;&#x8BA1;&#x300B;&#x4E00;&#x4E66;&#x4E2D;&#xFF0C;&#x4F5C;&#x8005;&#x66FE;&#x8BF4;&#xFF1A;</p>
<blockquote>
<p>&#x5982;&#x679C;&#x8BF4;Evans&#x5728;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x793E;&#x533A;&#x6709;&#x4E00;&#x9879;&#x53D1;&#x660E;&#xFF0C;&#x90A3;&#x4FBF;&#x662F;<strong>&#x901A;&#x7528;&#x8BED;&#x8A00;</strong>&#x3002;&#x53EF;&#x89C1;&#x901A;&#x7528;&#x8BED;&#x8A00;&#x5728;DDD&#x4E2D;&#x5E94;&#x5F53;&#x662F;&#x4E00;&#x4E2A;&#x9700;&#x8981;&#x91CD;&#x89C6;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
</blockquote>
<p>&#x4E66;&#x4E2D;&#x8BA4;&#x4E3A;&#x901A;&#x7528;&#x8BED;&#x8A00;&#x662F;&#x4E00;&#x79CD;&#x534F;&#x4F5C;&#x6A21;&#x5F0F;&#xFF0C;&#x53CD;&#x6620;&#x7684;&#x662F;&#x9886;&#x57DF;&#x4E13;&#x5BB6;&#x5BF9;&#x4E8E;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x601D;&#x7EF4;&#x6A21;&#x578B;&#xFF0C;&#x7528;&#x4E8E;&#x6355;&#x6349;&#x7279;&#x5B9A;&#x4E1A;&#x52A1;&#x9886;&#x57DF;&#x4E2D;&#x7684;&#x6982;&#x5FF5;&#x548C;&#x672F;&#x8BED;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x9886;&#x57DF;&#x901A;&#x8FC7;&#x4E0D;&#x540C;&#x7684;&#x540D;&#x8BCD;&#x3001;&#x5F62;&#x5BB9;&#x8BCD;&#x548C;&#x52A8;&#x8BCD;&#x6765;&#x8868;&#x8FBE;&#x8F6F;&#x4EF6;&#x6A21;&#x578B;&#xFF0C;&#x8FD9;&#x4E9B;&#x8BCD;&#x6C47;&#xFF08;&#x901A;&#x7528;&#x8BED;&#x8A00;&#xFF09;&#x4E5F;&#x5E94;&#x5F53;&#x662F;&#x5F00;&#x53D1;&#x56E2;&#x961F;&#x6B63;&#x5F0F;&#x4F7F;&#x7528;&#x7684;&#x3002;</p>
<p>&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;<code>&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;</code>&#x548C;<code>&#x901A;&#x7528;&#x8BED;&#x8A00;</code>&#x662F;&#x6210;&#x5BF9;&#x51FA;&#x73B0;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x901A;&#x7528;&#x8BED;&#x8A00;&#x5728;&#x4E00;&#x4E2A;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x7684;&#x542B;&#x4E49;&#x662F;&#x552F;&#x4E00;&#x4E14;&#x660E;&#x786E;&#x7684;&#x3002;</p>
<p>&#x5728;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x4E1A;&#x52A1;&#x9886;&#x57DF;&#x4E2D;&#xFF0C;&#x4E00;&#x822C;&#x4F1A;&#x5212;&#x5206;&#x51FA;&#x6765;&#x591A;&#x4E2A;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#xFF0C;&#x4E3A;&#x5B8C;&#x6210;&#x590D;&#x6742;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#xFF0C;&#x4ED6;&#x4EEC;&#x9700;&#x8981;&#x96C6;&#x6210;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5982;&#x4E0B;&#x793A;&#x610F;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="images/context-maps.PNG" alt="&#x4E0A;&#x4E0B;&#x6587;&#x6620;&#x5C04;&#x56FE;"></p>
<p>&#x56FE;&#x4E2D;&#x4E0A;&#x4E0B;&#x6587;&#x4E4B;&#x95F4;&#x7684;&#x96C6;&#x6210;&#x5173;&#x7CFB;&#x4E3B;&#x8981;&#x6709;&#xFF1A;</p>
<p>(1) Open Host Service&#xFF1A;&#x5F00;&#x653E;&#x4E3B;&#x673A;&#x670D;&#x52A1;</p>
<p>(2) Published Language&#xFF1A;&#x53D1;&#x5E03;&#x8BED;&#x8A00;</p>
<p>(3) Anticorruption Layer&#xFF1A;&#x9632;&#x8150;&#x5C42;</p>
<p>(4) Customer-Supplier&#xFF1A;&#x5BA2;&#x6237;&#x65B9;-&#x4F9B;&#x5E94;&#x65B9;</p>
<p>(5) Partnership&#xFF1A;&#x5408;&#x4F5C;&#x5173;&#x7CFB;</p>
<p>(6) Conformist&#xFF1A;&#x9075;&#x5949;&#x8005;</p>
<p>(7) Shared Kernel&#xFF1A;&#x5171;&#x4EAB;&#x5185;&#x6838;</p>
<h4 id="&#x6218;&#x672F;&#x5EFA;&#x6A21;tactical-modeling">&#x6218;&#x672F;&#x5EFA;&#x6A21;(Tactical Modeling)</h4>
<p>&#x6218;&#x672F;&#x5EFA;&#x6A21;&#x662F;&#x57FA;&#x4E8E;&#x67D0;&#x4E2A;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x4E4B;&#x4E2D;&#x7684;&#xFF0C;&#x7528;&#x4E8E;&#x5E2E;&#x52A9;&#x521B;&#x5EFA;DDD&#x6A21;&#x578B;&#x91CC;&#x9762;&#x7684;&#x5404;&#x4E2A;&#x90E8;&#x4EF6;&#xFF0C;&#x5176;&#x6709;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x90E8;&#x4EF6;&#x5C31;&#x662F;<code>&#x805A;&#x5408;</code>&#x3002;</p>
<p>&#x805A;&#x5408;&#x7531;&#x5B9E;&#x4F53;&#x3001;&#x503C;&#x5BF9;&#x8C61;&#x7EC4;&#x6210;&#xFF0C;&#x805A;&#x5408;&#x9700;&#x8981;&#x5728;&#x6574;&#x4E2A;&#x751F;&#x547D;&#x5468;&#x671F;&#x4E2D;&#x4FDD;&#x6301;&#x4E8B;&#x52A1;&#x4E00;&#x81F4;&#x3002;&#x805A;&#x5408;&#x5B9E;&#x4F8B;&#x901A;&#x8FC7;<code>&#x8D44;&#x6E90;&#x5E93;Repository</code>&#x8FDB;&#x884C;&#x6301;&#x4E45;&#x5316;&#x3002;</p>
<p>&#x5982;&#x4E0B;&#x56FE;&#x4E3A;&#x4E24;&#x4E2A;&#x805A;&#x5408;&#xFF1A;</p>
<p><img src="images/two-aggregate.PNG" alt="&#x4E24;&#x4E2A;&#x805A;&#x5408;"></p>
<p>&#x805A;&#x5408;&#x4E0A;&#x9762;&#x5C06;&#x4F1A;&#x627F;&#x8F7D;&#x5927;&#x90E8;&#x5206;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#xFF08;&#x901A;&#x8FC7;&#x8C03;&#x7528;&#x5B9E;&#x4F53;&#x6216;&#x503C;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x6CD5;&#x5B8C;&#x6210;&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4E00;&#x4E9B;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x4E0D;&#x9002;&#x5408;&#x51FA;&#x73B0;&#x5728;&#x67D0;&#x4E2A;&#x5177;&#x4F53;&#x7684;&#x5B9E;&#x4F53;&#x6216;&#x503C;&#x5BF9;&#x8C61;&#x4E2D;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x5F15;&#x5165;<strong>&#x65E0;&#x72B6;&#x6001;</strong>&#x7684;<code>&#x9886;&#x57DF;&#x670D;&#x52A1;</code>&#x3002;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x53EF;&#x4EE5;&#x64CD;&#x4F5C;&#x591A;&#x4E2A;&#x805A;&#x5408;&#x5B8C;&#x6210;&#x76F8;&#x5E94;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x3002;</p>
<p>&#x800C;&#x5F53;&#x805A;&#x5408;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x64CD;&#x4F5C;&#x4E2D;&#x53D1;&#x751F;&#x91CD;&#x8981;&#x4E8B;&#x4EF6;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;<code>&#x9886;&#x57DF;&#x4E8B;&#x4EF6;</code>&#x6765;&#x8FDB;&#x884C;&#x5E7F;&#x64AD;&#x901A;&#x77E5;&#xFF0C;&#x9886;&#x57DF;&#x4E8B;&#x4EF6;&#x7531;&#x805A;&#x5408;&#x6765;&#x53D1;&#x5E03;&#x3002;</p>
<p>DDD&#x5728;&#x4EE3;&#x7801;&#x5B9E;&#x8DF5;&#x4E2D;&#x5F15;&#x5165;&#x4E86;<code>&#x6A21;&#x5757;</code>&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x300A;&#x5B9E;&#x73B0;&#x9886;&#x57DF;&#x9A71;&#x52A8;&#x300B;&#x4E00;&#x4E66;&#x4E2D;&#x7528;Java&#x7684;&#x5305;&#x6216;&#x8005;C#&#x91CC;&#x9762;&#x7684;&#x547D;&#x540D;&#x7A7A;&#x95F4;&#x6765;&#x7C7B;&#x6BD4;&#x3002;</p>
<h4 id="&#x67B6;&#x6784;architecture">&#x67B6;&#x6784;(Architecture)</h4>
<p><code>&#x6218;&#x7565;&#x5EFA;&#x6A21;</code>&#x548C;<code>&#x6218;&#x672F;&#x5EFA;&#x6A21;</code>&#x5E94;&#x8BE5;&#x662F;<strong>&#x67B6;&#x6784;&#x4E2D;&#x7ACB;</strong>&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x8BBE;&#x8BA1;&#x51FA;&#x6765;&#x7684;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x4E4B;&#x95F4;&#x5219;&#x662F;&#x5B58;&#x5728;&#x67B6;&#x6784;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#xFF1A;&#x516D;&#x8FB9;&#x5F62;(Hexagonal)&#x67B6;&#x6784;&#x3001;&#x9762;&#x5411;&#x670D;&#x52A1;(Service-Oriented)&#x67B6;&#x6784;&#x3001;REST&#x67B6;&#x6784;&#x3001;&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;(Event-Driven)&#x67B6;&#x6784;&#x3002;</p>
<p>&#x4EE5;&#x4E0B;&#x4E3A;&#x300A;&#x5B9E;&#x73B0;&#x9886;&#x57DF;&#x9A71;&#x52A8;&#x300B;&#x4E00;&#x4E66;&#x4E2D;&#x5173;&#x4E8E;DDD&#x7684;&#x516D;&#x8FB9;&#x5F62;&#x67B6;&#x6784;&#x793A;&#x610F;&#x56FE;&#xFF1A;</p>
<p><img src="images/the-hexagonal-architecture.PNG" alt="&#x516D;&#x8FB9;&#x5F62;&#x67B6;&#x6784;"></p>
<h4 id="ddd&#x4E00;&#x4E9B;&#x6982;&#x5FF5;&#x7B80;&#x4ECB;">DDD&#x4E00;&#x4E9B;&#x6982;&#x5FF5;&#x7B80;&#x4ECB;</h4>
<ul>
<li><p><strong>&#x9886;&#x57DF;&#x6A21;&#x578B;</strong></p>
<blockquote>
<p>It&#x2019;s a software model of the very specific business domain you are working in. Often it&#x2019;s implemented as an object model, where those objects have both data and behavior with literal and accurate business meaning. Creating a unique, carefully crafted domain model at the heart of a core, strategic application or subsystem is essential to practicing DDD. With DDD your domain models will tend to be smallish, very focused. Using DDD, you never try to model the whole business enterprise with a single, large domain model. Phew, that&#x2019;s good!</p>
</blockquote>
<p>  &#x4E0A;&#x9762;&#x662F;&#x5F15;&#x7528;&#x300A;&#x5B9E;&#x73B0;&#x9886;&#x57DF;&#x9A71;&#x52A8;&#x300B;&#x82F1;&#x6587;&#x7248;&#x7684;&#x4E00;&#x6BB5;&#x8BDD;&#xFF0C;&#x7FFB;&#x8BD1;&#x6210;&#x4E2D;&#x6587;&#x7684;&#x610F;&#x601D;&#x662F;&#xFF1A;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x662F;&#x5173;&#x4E8E;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x4E1A;&#x52A1;&#x7684;&#x8F6F;&#x4EF6;&#x6A21;&#x578B;&#xFF0C;&#x901A;&#x5E38;&#x901A;&#x8FC7;<code>&#x5BF9;&#x8C61;&#x6A21;&#x578B;</code>&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x5305;&#x542B;&#x4E86;&#x6570;&#x636E;&#x548C;&#x884C;&#x4E3A;&#xFF0C;&#x5E76;&#x4E14;&#x8868;&#x8FBE;&#x4E86;&#x51C6;&#x786E;&#x7684;&#x4E1A;&#x52A1;&#x542B;&#x4E49;&#x3002;</p>
</li>
<li><p><strong>&#x8D2B;&#x8840;&#x9886;&#x57DF;&#x5BF9;&#x8C61;(Anemic Domain Model)</strong></p>
<p>  &#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7F3A;&#x5C11;&#x884C;&#x4E3A;&#xFF08;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#xFF09;&#xFF0C;&#x800C;&#x53EA;&#x6709;Setter/Getter&#x51FD;&#x6570;&#x3002;</p>
</li>
<li><p><strong>&#x5BF9;&#x8C61;-&#x5173;&#x7CFB;&#x963B;&#x6297;&#x5931;&#x914D;(Object-Relational Impedance Mismatch)</strong></p>
<p>  &#x9762;&#x5411;&#x5BF9;&#x8C61;&#x5411;&#x4F20;&#x7EDF;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x5B58;&#x653E;&#x6570;&#x636E;&#x5B58;&#x5728;&#x8868;&#x8FF0;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
</li>
<li><p><strong>&#x8D2B;&#x8840;&#x75C7;&#x5BFC;&#x81F4;&#x7684;&#x5931;&#x5FC6;&#x75C7;</strong></p>
<p>  &#x8D2B;&#x8840;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#x5B9E;&#x73B0;&#x4F1A;&#x5BFC;&#x81F4;&#x4E1A;&#x52A1;&#x610F;&#x56FE;&#x4E0D;&#x660E;&#x786E;&#xFF0C;&#x6700;&#x540E;&#x4E22;&#x5931;&#x4E1A;&#x52A1;&#x542B;&#x4E49;&#xFF0C;&#x79F0;&#x4E3A;&#x5931;&#x5FC6;&#x4E86;&#x3002;</p>
</li>
</ul>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; hsuloong.github.io 2021 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x7F16;&#x8F91;&#x4E8E;&#xFF1A;
2021-08-11 17:29:29
</span></footer>
<script>console.log("plugin-popup....");document.onclick = function(e){ e.target.tagName === "IMG" && window.open(e.target.src,e.target.src)}</script><style>img{cursor:pointer}</style>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../" class="navigation navigation-prev " aria-label="Previous page: DDD领域驱动设计">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="strategic-modeling.html" class="navigation navigation-next " aria-label="Next page: 战略建模">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"开始领域驱动设计","level":"1.2.1","depth":2,"next":{"title":"战略建模","level":"1.2.2","depth":2,"path":"domain-driven-design/notes/strategic-modeling.md","ref":"domain-driven-design/notes/strategic-modeling.md","articles":[]},"previous":{"title":"DDD领域驱动设计","level":"1.2","depth":1,"path":"domain-driven-design/README.md","ref":"domain-driven-design/README.md","articles":[{"title":"开始领域驱动设计","level":"1.2.1","depth":2,"path":"domain-driven-design/notes/start-domain-drive-design.md","ref":"domain-driven-design/notes/start-domain-drive-design.md","articles":[]},{"title":"战略建模","level":"1.2.2","depth":2,"path":"domain-driven-design/notes/strategic-modeling.md","ref":"domain-driven-design/notes/strategic-modeling.md","articles":[]},{"title":"架构设计","level":"1.2.3","depth":2,"path":"domain-driven-design/notes/architecture.md","ref":"domain-driven-design/notes/architecture.md","articles":[]},{"title":"战术建模","level":"1.2.4","depth":2,"path":"domain-driven-design/notes/tactical-modeling.md","ref":"domain-driven-design/notes/tactical-modeling.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["-lunr","-search","search-pro","expandable-chapters","splitter","back-to-top-button","-sharing","sharing-plus","tbfed-pagefooter","popup"],"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy hsuloong.github.io 2021","modify_label":"编辑于：","modify_format":"YYYY-MM-DD HH:mm:ss"},"splitter":{},"search-pro":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"popup":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"back-to-top-button":{},"sharing":{"qq":true,"all":["douban","facebook","google","instapaper","linkedin","twitter","weibo","messenger","qq","qzone","viber","whatsapp"],"douban":true,"facebook":true,"weibo":true,"twitter":true,"pocket":true,"google":true,"qzone":true},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"expandable-chapters":{}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"domain-driven-design/notes/start-domain-drive-design.md","mtime":"2021-08-11T17:29:29.301Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-08-11T17:30:14.830Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

