
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>战略建模 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="architecture.html" />
    
    
    <link rel="prev" href="start-domain-drive-design.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    README简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../">
            
                <a href="../">
            
                    
                    DDD领域驱动设计
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="start-domain-drive-design.html">
            
                <a href="start-domain-drive-design.html">
            
                    
                    开始领域驱动设计
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.2" data-path="strategic-modeling.html">
            
                <a href="strategic-modeling.html">
            
                    
                    战略建模
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="architecture.html">
            
                <a href="architecture.html">
            
                    
                    架构设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="tactical-modeling.html">
            
                <a href="tactical-modeling.html">
            
                    
                    战术建模
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../../computer-programming/">
            
                <a href="../../computer-programming/">
            
                    
                    程序设计：写出优雅的代码
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../../computer-programming/notes/design-patterns.html">
            
                <a href="../../computer-programming/notes/design-patterns.html">
            
                    
                    设计模式
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >战略建模</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h4 id="&#x6218;&#x7565;&#x5EFA;&#x6A21;strategic-modeling">&#x6218;&#x7565;&#x5EFA;&#x6A21;(Strategic Modeling)</h4>
<p>&#x5728;&#x5B66;&#x4E60;&#x6218;&#x7565;&#x5EFA;&#x6A21;&#x4E4B;&#x524D;&#xFF0C;&#x5148;&#x7406;&#x6E05;&#x51E0;&#x4E2A;&#x6982;&#x5FF5;&#xFF1A;</p>
<ul>
<li><p><strong>&#x9886;&#x57DF;(Domain)</strong></p>
<p>  &#x5E7F;&#x4E49;&#x4E0A;&#xFF0C;&#x9886;&#x57DF;&#x662F;&#x4E00;&#x4E2A;&#x7EC4;&#x7EC7;&#x6240;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x53CA;&#x5176;&#x6240;&#x5305;&#x542B;&#x7684;&#x4E00;&#x5207;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x7EC4;&#x7EC7;&#x7684;&#x4E1A;&#x52A1;&#x8303;&#x56F4;&#x3002;&#x6BD4;&#x5982;&#x817E;&#x8BAF;&#x7684;&#x9886;&#x57DF;&#x662F;&#x793E;&#x4EA4;&#xFF0C;&#x963F;&#x91CC;&#x7684;&#x9886;&#x57DF;&#x662F;&#x7535;&#x5B50;&#x5546;&#x52A1;&#x3002;</p>
<p>  &#x4E00;&#x4E2A;&#x9886;&#x57DF;&#x5728;DDD&#x4E2D;&#x4F1A;&#x5212;&#x5206;&#x6210;&#x591A;&#x4E2A;&#x5B50;&#x57DF;&#xFF0C;&#x800C;<code>&#x9886;&#x57DF;&#x6A21;&#x578B;</code>&#x5219;&#x662F;&#x5728;<code>&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;</code>&#x4E2D;&#x5B8C;&#x6210;&#x5F00;&#x53D1;&#x3002;</p>
</li>
<li><p><strong>&#x5B50;&#x57DF;(Subdomain)</strong></p>
<p>  &#x4EE5;&#x300A;&#x5B9E;&#x73B0;&#x9886;&#x57DF;&#x9A71;&#x52A8;&#x8BBE;&#x8BA1;&#x300B;&#x4E66;&#x4E2D;&#x4E00;&#x4E2A;&#x56FE;&#x4E3A;&#x4F8B;&#xFF0C;&#x56FE;&#x4E2D;&#x6700;&#x5927;&#x8FB9;&#x754C;&#x662F;&#x4E00;&#x4E2A;<code>&#x9886;&#x57DF;</code>&#xFF0C;&#x5185;&#x90E8;&#x88AB;&#x5212;&#x5206;&#x6210;&#x591A;&#x4E2A;<code>&#x5B50;&#x57DF;</code>&#xFF1A;</p>
</li>
</ul>
<p><img src="images/abstract-business-domain.PNG" alt=""></p>
<ul>
<li><p><strong>&#x6838;&#x5FC3;&#x57DF;(Core Domain)</strong></p>
<p>  &#x5177;&#x6709;&#x6700;&#x5927;&#x4E1A;&#x52A1;&#x4EF7;&#x503C;&#x7684;&#x5B50;&#x57DF;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x4E00;&#x4E2A;&#x4E1A;&#x52A1;&#x6838;&#x5FC3;&#x7ADE;&#x4E89;&#x529B;&#x3002;</p>
</li>
<li><p><strong>&#x652F;&#x6491;&#x5B50;&#x57DF;(Supporting Subdomain)</strong></p>
<p>  &#x652F;&#x6301;&#x4E1A;&#x52A1;&#x4F46;&#x5374;&#x4E0D;&#x662F;&#x6838;&#x5FC3;&#x57DF;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x6210;&#x4E3A;&#x652F;&#x6491;&#x5B50;&#x57DF;&#xFF0C;&#x5982;&#x679C;&#x80FD;&#x591F;&#x901A;&#x7528;&#x4E8E;&#x6574;&#x4E2A;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#xFF0C;&#x90A3;&#x4E48;&#x4FBF;&#x6210;&#x4E3A;<code>&#x901A;&#x7528;&#x5B50;&#x57DF;</code>&#x3002;</p>
</li>
<li><p><strong>&#x901A;&#x7528;&#x5B50;&#x57DF;(Generic Subdomain)</strong></p>
<p>  &#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x4E8E;&#x6574;&#x4E2A;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#xFF0C;&#x6BD4;&#x5982;&#x8EAB;&#x4EFD;&#x9A8C;&#x8BC1;&#x5B50;&#x57DF;&#x53EF;&#x80FD;&#x6210;&#x4E3A;&#x901A;&#x7528;&#x5B50;&#x57DF;&#x3002;</p>
</li>
<li><p><strong>&#x5927;&#x6CE5;&#x7403;&#x67B6;&#x6784;(Ball of Mud)</strong></p>
<p>  &#x57FA;&#x672C;&#x4E0A;&#x6240;&#x6709;&#x96BE;&#x4EE5;&#x7EF4;&#x62A4;&#x3001;&#x6253;&#x8865;&#x4E01;&#x5F0F;&#x4F18;&#x5316;&#x7684;&#x7CFB;&#x7EDF;&#x5927;&#x6982;&#x7387;&#x662F;&#x4E00;&#x4E2A;&#x5927;&#x6CE5;&#x7403;&#x3002;&#x8FD9;&#x4E9B;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x6742;&#x4E71;&#x65E0;&#x7AE0;&#x3001;&#x81C3;&#x80BF;&#x5E9E;&#x5927;&#x3002;</p>
</li>
<li><p><strong>&#x95EE;&#x9898;&#x7A7A;&#x95F4;(Problem Space)</strong></p>
<p>  &#x95EE;&#x9898;&#x7A7A;&#x95F4;&#x662F;&#x9886;&#x57DF;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x662F;&#x6838;&#x5FC3;&#x57DF;&#x548C;&#x5176;&#x4ED6;&#x5B50;&#x57DF;&#x7684;&#x7EC4;&#x5408;&#x3002;</p>
</li>
<li><p><strong>&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7A7A;&#x95F4;(solution space)</strong></p>
<p>  &#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7A7A;&#x95F4;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x6216;&#x8005;&#x591A;&#x4E2A;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#xFF08;&#x4E00;&#x7EC4;&#x7279;&#x5B9A;&#x8F6F;&#x4EF6;&#x6A21;&#x578B;&#xFF09;&#xFF0C;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x662F;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x8F6F;&#x4EF6;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<p>  &#x4E00;&#x822C;&#x800C;&#x8A00;&#x5C3D;&#x91CF;&#x4F7F;&#x5F97;&#x5B50;&#x57DF;&#x548C;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x4E00;&#x5BF9;&#x4E00;&#x5BF9;&#x5E94;&#xFF0C;&#x6216;&#x8005;&#x5C06;&#x591A;&#x4E2A;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x5305;&#x542B;&#x5728;&#x4E00;&#x4E2A;&#x5B50;&#x57DF;&#x4E2D;&#x3002;&#x5982;&#x4E0B;&#x56FE;&#xFF1A;</p>
</li>
</ul>
<p><img src="images/the-core-domain-and-other-subdomains.PNG" alt=""></p>
<ul>
<li><p><strong>&#x4E0A;&#x4E0B;&#x6587;&#x6620;&#x5C04;&#x56FE;(Context Maps)</strong></p>
<p>  &#x7528;&#x4E8E;&#x5B8C;&#x6210;&#x4E0D;&#x540C;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x96C6;&#x6210;&#x4EE5;&#x53CA;&#x901A;&#x7528;&#x8BED;&#x8A00;&#x7684;&#x6620;&#x5C04;&#x3002;</p>
</li>
<li><p><strong>&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;(Bounded Context)</strong></p>
<blockquote>
<p>A Bounded Context is an explicit boundary within which a domain model exists. Inside the boundary all terms and phrases of the Ubiquitous Language have specific meaning, and the model reflects the Language with exactness.</p>
</blockquote>
<p>  &#x4E00;&#x4E2A;&#x663E;&#x5F0F;&#x7684;&#x8FB9;&#x754C;&#xFF0C;&#x548C;&#x901A;&#x7528;&#x8BED;&#x8A00;&#x4E00;&#x5BF9;&#x4E00;&#xFF0C;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x5B58;&#x5728;&#x4E8E;&#x8BE5;&#x8FB9;&#x754C;&#x4E4B;&#x5185;&#x3002;</p>
<p>  &#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x5E76;&#x4E0D;&#x662F;&#x53EA;&#x5305;&#x542B;&#x9886;&#x57DF;&#x6A21;&#x578B;&#xFF0C;&#x5982;&#x679C;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x9A71;&#x52A8;&#x7740;&#x6570;&#x636E;&#x5E93;Schema&#x8BBE;&#x8BA1;&#xFF0C;&#x90A3;&#x4E48;&#x6570;&#x636E;&#x5E93;Schema&#x4E5F;&#x5C5E;&#x4E8E;&#x8BE5;&#x4E0A;&#x4E0B;&#x6587;&#x4E4B;&#x4E2D;&#x3002;&#x6709;&#x5982;&#x679C;&#x7528;&#x6237;&#x754C;&#x9762;&#x9A71;&#x52A8;&#x7740;&#x6A21;&#x578B;&#x884C;&#x4E3A;&#xFF0C;&#x8BE5;&#x7528;&#x6237;&#x754C;&#x9762;&#x4E5F;&#x5C5E;&#x4E8E;&#x4E0A;&#x4E0B;&#x6587;&#x3002;</p>
</li>
<li><p><strong>&#x901A;&#x7528;&#x8BED;&#x8A00;(Ubiquitous Language)</strong></p>
<p>  &#x901A;&#x7528;&#x8BED;&#x8A00;&#x662F;&#x6574;&#x4E2A;&#x56E2;&#x961F;&#x5171;&#x4EAB;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x56E2;&#x961F;&#x5185;&#x6240;&#x6709;&#x6210;&#x5458;&#xFF08;&#x5305;&#x62EC;&#x9886;&#x57DF;&#x4E13;&#x5BB6;&#x548C;&#x5F00;&#x53D1;&#x8005;&#xFF09;&#x4F7F;&#x7528;&#x901A;&#x7528;&#x8BED;&#x8A00;&#x6765;&#x4EA4;&#x6D41;&#x3002;&#x8BE5;&#x8BED;&#x8A00;&#x662F;&#x56E2;&#x961F;&#x5171;&#x540C;&#x521B;&#x5EFA;&#x7684;&#x516C;&#x7528;&#x8BED;&#x8A00;&#xFF0C;&#x4E0D;&#x4E00;&#x5B9A;&#x975E;&#x8981;&#x91C7;&#x7528;&#x5DE5;&#x4E1A;&#x6807;&#x51C6;&#x672F;&#x8BED;&#x3002;</p>
</li>
</ul>
<p>&#x6700;&#x540E;&#x300A;&#x5B9E;&#x73B0;&#x9886;&#x57DF;&#x9A71;&#x52A8;&#x8BBE;&#x8BA1;&#x300B;&#x4E66;&#x4E2D;&#x7ED9;&#x51FA;&#x4E86;SaasOvation&#x56E2;&#x961F;&#x6218;&#x7565;&#x8BBE;&#x8BA1;&#x540E;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#xFF1A;</p>
<p><img src="images/sample-bounded-contexts.PNG" alt=""></p>
<p><img src="images/collaboration-context.PNG" alt=""></p>
<p><img src="images/identity-and_access-context.PNG" alt=""></p>
<p><img src="images/agile-project-management-context.PNG" alt=""></p>
<h4 id="&#x901A;&#x7528;&#x8BED;&#x8A00;ubiquitous-language">&#x901A;&#x7528;&#x8BED;&#x8A00;(Ubiquitous Language)</h4>
<p>&#x901A;&#x7528;&#x8BED;&#x8A00;&#x548C;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x662F;&#x6218;&#x7565;&#x5EFA;&#x6A21;&#x6700;&#x91CD;&#x8981;&#x7684;&#x7EC4;&#x6210;&#xFF0C;&#x4E5F;&#x662F;DDD&#x7684;&#x652F;&#x67F1;&#xFF0C;&#x6B63;&#x5982;&#x4E0A;&#x9762;&#x6982;&#x5FF5;&#x6240;&#x8BF4;&#xFF0C;&#x4E24;&#x8005;&#x662F;&#x4E00;&#x5BF9;&#x4E00;&#x7684;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x5728;&#x65E5;&#x5E38;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x600E;&#x4E48;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x627E;&#x51FA;&#x901A;&#x7528;&#x8BED;&#x8A00;&#x5462;&#xFF1F;&#x4EE5;&#x4E0B;&#x662F;&#x300A;&#x5B9E;&#x73B0;&#x9886;&#x57DF;&#x9A71;&#x52A8;&#x300B;&#x4E00;&#x4E66;&#x4E2D;&#x7ED9;&#x51FA;&#x7684;&#x65B9;&#x6CD5;&#xFF1A;</p>
<ul>
<li><p><strong>&#x7ED8;&#x5236;&#x7269;&#x7406;&#x6A21;&#x578B;&#x56FE;&#x548C;&#x6982;&#x5FF5;&#x6A21;&#x578B;&#x56FE;&#xFF0C;&#x5E76;&#x6807;&#x4EE5;&#x540D;&#x5B57;&#x548C;&#x884C;&#x4E3A;</strong></p>
<p>  &#x8FD9;&#x4E00;&#x6B65;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x9886;&#x57DF;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x4EE5;&#x53CA;&#x5BF9;&#x8C61;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x91CC;&#x9762;&#x7684;&#x672F;&#x8BED;&#x53EF;&#x80FD;&#x5C31;&#x662F;&#x901A;&#x7528;&#x8BED;&#x8A00;&#x3002;</p>
</li>
<li><p><strong>&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x5B9A;&#x4E49;&#x7684;&#x672F;&#x8BED;&#x8868;</strong></p>
<p>  &#x7ED9;&#x4F60;&#x80FD;&#x60F3;&#x5230;&#x7684;&#x672F;&#x8BED;&#x5217;&#x4E00;&#x4E2A;&#x8868;&#x683C;&#xFF0C;&#x627E;&#x51FA;&#x5176;&#x4E2D;&#x6BD4;&#x8F83;&#x597D;&#x4EE5;&#x53CA;&#x4E0D;&#x597D;&#x7684;&#xFF0C;&#x6162;&#x6162;&#x5F62;&#x6210;&#x5408;&#x7406;&#x7684;&#x901A;&#x7528;&#x8BED;&#x8A00;&#x3002;</p>
</li>
</ul>
<p>&#x65E0;&#x8BBA;&#x91C7;&#x7528;&#x4EC0;&#x4E48;&#x65B9;&#x6CD5;&#xFF0C;&#x901A;&#x7528;&#x8BED;&#x8A00;&#x7684;&#x5F62;&#x6210;&#x6700;&#x91CD;&#x8981;&#x7684;&#x8FD8;&#x662F;&#x56E2;&#x961F;&#x4EA4;&#x6D41;&#x3002;</p>
<h4 id="&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;bounded-context">&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;(Bounded Context)</h4>
<p>&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x662F;&#x4E00;&#x4E2A;&#x663E;&#x5F0F;&#x7684;&#x8FB9;&#x754C;&#xFF0C;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x5B58;&#x5728;&#x4E8E;&#x8FB9;&#x754C;&#x4E4B;&#x5185;&#x3002;&#x5728;&#x8FB9;&#x754C;&#x5185;&#xFF0C;&#x901A;&#x7528;&#x8BED;&#x8A00;&#x672F;&#x8BED;&#x90FD;&#x6709;&#x7279;&#x5B9A;&#x7684;&#x542B;&#x4E49;&#xFF0C;&#x800C;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x5219;&#x9700;&#x8981;&#x51C6;&#x786E;&#x53CD;&#x6620;&#x901A;&#x7528;&#x8BED;&#x8A00;&#x3002;</p>
<p>&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x4E0D;&#x540C;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x540D;&#x5B57;&#x76F8;&#x540C;&#x6216;&#x8005;&#x76F8;&#x8FD1;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x79CD;&#x5BF9;&#x8C61;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x9650;&#x754C;&#x4E0A;&#x4E0A;&#x4E0B;&#x6587;&#x542B;&#x4E49;&#x5176;&#x5B9E;&#x4E0D;&#x5B8C;&#x5168;&#x4E00;&#x81F4;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x4EE5;<code>&#x8D26;&#x6237;</code>&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x4E3A;&#x4F8B;&#xFF0C;&#x8D26;&#x6237;&#x53EF;&#x80FD;&#x5728;&#x91D1;&#x878D;&#x9886;&#x57DF;&#x4EE3;&#x8868;&#x7528;&#x6237;&#x5728;&#x91D1;&#x878D;&#x516C;&#x53F8;&#x7684;&#x5B58;&#x6B3E;&#x6D88;&#x8D39;&#x72B6;&#x6001;&#xFF0C;&#x800C;&#x5728;&#x535A;&#x5BA2;&#x9886;&#x57DF;&#x5219;&#x53EF;&#x80FD;&#x4EE3;&#x8868;&#x8BB0;&#x5F55;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x6587;&#x7AE0;&#x8BFB;&#x5199;&#x884C;&#x4E3A;&#x3002;</p>
<p>&#x5F53;&#x5F00;&#x59CB;&#x96C6;&#x6210;&#x4E0A;&#x4E0B;&#x6587;&#x65F6;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x6982;&#x5FF5;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x6620;&#x5C04;&#xFF0C;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#x53EF;&#x80FD;&#x5171;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x3002;</p>
<p>&#x4EE5;&#x5FAE;&#x4FE1;&#x4E3A;&#x4F8B;&#xFF1A;&#x5FAE;&#x4FE1;&#x8D26;&#x6237;&#x5728;&#x6D88;&#x606F;&#x9886;&#x57DF;&#x53EF;&#x80FD;&#x4F1A;&#x6620;&#x5C04;&#x6210;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x8005;&#x3001;&#x6D88;&#x606F;&#x63A5;&#x6536;&#x8005;&#xFF1B;&#x5728;&#x652F;&#x4ED8;&#x9886;&#x57DF;&#x53EF;&#x80FD;&#x4F1A;&#x6620;&#x5C04;&#x6210;&#x6D88;&#x8D39;&#x8005;&#xFF1B;&#x5728;&#x516C;&#x4F17;&#x53F7;&#x53EF;&#x80FD;&#x4F1A;&#x6620;&#x5C04;&#x6210;&#x4F5C;&#x8005;&#x3002;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#x90FD;&#x5171;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#xFF1A;&#x5FAE;&#x4FE1;&#x53F7;&#x3002;</p>
<p>&#x901A;&#x5E38;&#x5BF9;&#x4E8E;&#x5FAE;&#x670D;&#x800C;&#x8A00;&#xFF0C;&#x4E00;&#x4E2A;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x4E00;&#x822C;&#x4F1A;&#x5728;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x5185;&#x5B9E;&#x73B0;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x4E2A;&#x5E76;&#x4E0D;&#x662F;&#x5F3A;&#x5236;&#xFF0C;&#x4F46;&#x81F3;&#x5C11;&#x8981;&#x4FDD;&#x8BC1;&#x4E00;&#x4E2A;&#x805A;&#x5408;&#x5185;&#x805A;&#x5728;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x4E2D;&#x3002;</p>
<h4 id="&#x4E0A;&#x4E0B;&#x6587;&#x6620;&#x5C04;&#x56FE;context-map">&#x4E0A;&#x4E0B;&#x6587;&#x6620;&#x5C04;&#x56FE;(Context Map)</h4>
<p>&#x5F53;&#x5F00;&#x59CB;&#x91C7;&#x7528;DDD&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x5148;&#x7ED8;&#x5236;&#x4E0A;&#x4E0B;&#x6587;&#x6620;&#x5C04;&#x56FE;&#xFF0C;&#x8BE5;&#x56FE;&#x5305;&#x62EC;&#x6240;&#x5904;&#x4E1A;&#x52A1;&#x9879;&#x76EE;&#x7684;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x4EE5;&#x53CA;&#x96C6;&#x6210;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x56FE;&#x5DEE;&#x4E0D;&#x591A;&#x957F;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#xFF1A;</p>
<p><img src="images/context-map-of-an-abstract-domain.PNG" alt=""></p>
<p>&#x56FE;&#x4E2D;U(Upstream)&#x4EE3;&#x8868;&#x4E0A;&#x6E38;&#xFF0C;D(Downstream)&#x4EE3;&#x8868;&#x4E0B;&#x6E38;&#x3002;</p>
<p>&#x5728;&#x8FDB;&#x884C;&#x4E0A;&#x4E0B;&#x6587;&#x96C6;&#x6210;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E0A;&#x4E0B;&#x6587;&#x4E3B;&#x8981;&#x6709;&#x8FD9;&#x4E9B;&#x96C6;&#x6210;&#x5173;&#x7CFB;&#xFF1A;</p>
<ul>
<li><p>&#x5408;&#x4F5C;&#x5173;&#x7CFB;(Partnership)</p>
<p>  &#x4E24;&#x4E2A;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x4E00;&#x8363;&#x4FF1;&#x8363;&#xFF0C;&#x4E00;&#x635F;&#x4FF1;&#x635F;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x4F1A;&#x534F;&#x8C03;&#x5F00;&#x53D1;&#x8BA1;&#x5212;&#x548C;&#x96C6;&#x6210;&#x7BA1;&#x7406;&#xFF0C;&#x63A5;&#x53E3;&#x6F14;&#x5316;&#x4E0A;&#x540C;&#x65F6;&#x6EE1;&#x8DB3;&#x4E24;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x9700;&#x6C42;&#x3002;</p>
</li>
<li><p>&#x5171;&#x4EAB;&#x5185;&#x6838;(Shared Kernel)</p>
<p>  &#x5171;&#x4EAB;&#x6A21;&#x578B;&#x548C;&#x4EE3;&#x7801;&#xFF0C;&#x9700;&#x8981;&#x591A;&#x65B9;&#x534F;&#x5546;&#x4E00;&#x81F4;&#x6765;&#x4FDD;&#x8BC1;&#x5185;&#x6838;&#x72B6;&#x6001;&#x7684;&#x7A33;&#x5B9A;&#x3002;</p>
</li>
<li><p>&#x5BA2;&#x6237;&#x65B9;-&#x4F9B;&#x5E94;&#x65B9;(Customer-Supplier)</p>
<p>  &#x4E24;&#x4E2A;&#x56E2;&#x961F;&#x5904;&#x4E8E;&#x4E0A;&#x4E0B;&#x6E38;&#x5173;&#x7CFB;&#xFF0C;&#x4E14;&#x4E0A;&#x6E38;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x4E8E;&#x4E0B;&#x6E38;&#x5B8C;&#x6210;&#x5F00;&#x53D1;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x4E0B;&#x6E38;&#x56E2;&#x961F;&#x7684;&#x5F00;&#x53D1;&#x53D7;&#x5230;&#x5F88;&#x5927;&#x7684;&#x5F71;&#x54CD;&#x3002;</p>
</li>
<li><p>&#x9075;&#x5949;&#x8005;(Conformist)</p>
<p>  &#x4E24;&#x4E2A;&#x56E2;&#x961F;&#x4E5F;&#x662F;&#x5C5E;&#x4E8E;&#x4E0A;&#x4E0B;&#x6E38;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x4F46;&#x662F;&#x4E0A;&#x6E38;&#x6CA1;&#x6709;&#x52A8;&#x529B;&#x63D0;&#x4F9B;&#x4E0B;&#x6E38;&#x6240;&#x9700;&#x65F6;&#xFF0C;&#x4E0B;&#x6E38;&#x53EA;&#x80FD;&#x76F2;&#x76EE;&#x4F7F;&#x7528;&#x4E0A;&#x6E38;&#x56E2;&#x961F;&#x7684;&#x6A21;&#x578B;&#x3002;</p>
</li>
<li><p>&#x9632;&#x8150;&#x5C42;(Anticorruption Layer)</p>
<p>  &#x5982;&#x679C;&#x5408;&#x4F5C;&#x5173;&#x7CFB;&#x3001;&#x5171;&#x4EAB;&#x5185;&#x6838;&#x3001;&#x5BA2;&#x6237;&#x65B9;-&#x4F9B;&#x5E94;&#x65B9;&#x5173;&#x7CFB;&#x65E0;&#x6CD5;&#x987A;&#x5229;&#x5B9E;&#x73B0;&#xFF0C;&#x4F1A;&#x5BFC;&#x81F4;&#x4E24;&#x4E2A;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x4E4B;&#x95F4;&#x7684;&#x7FFB;&#x8BD1;&#x6C9F;&#x901A;&#x53D8;&#x5F97;&#x56F0;&#x96BE;&#xFF0C;&#x6B64;&#x65F6;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x9632;&#x8150;&#x5C42;&#x6765;&#x8FDB;&#x884C;&#x81EA;&#x5DF1;&#x65B9;&#x7684;&#x6A21;&#x578B;&#x4E0E;&#x4ED6;&#x65B9;&#x6A21;&#x578B;&#x7684;&#x7FFB;&#x8BD1;&#x8F6C;&#x6362;&#x3002;</p>
<p>  PS&#xFF1A;&#x53EF;&#x4F7F;&#x7528;<code>ACL</code>&#x6765;&#x7F29;&#x5199;&#x3002;</p>
</li>
<li><p>&#x5F00;&#x653E;&#x4E3B;&#x673A;&#x670D;&#x52A1;(Open Host Service)</p>
<p>  &#x5B9A;&#x4E49;&#x534F;&#x8BAE;&#xFF0C;&#x5B50;&#x7CFB;&#x7EDF;&#x901A;&#x8FC7;&#x534F;&#x8BAE;&#x6765;&#x8BBF;&#x95EE;&#xFF0C;&#x6BD4;&#x5982;RPC&#x534F;&#x8BAE;&#x3002;</p>
<p>  PS&#xFF1A;&#x53EF;&#x4F7F;&#x7528;<code>OHS</code>&#x6765;&#x7F29;&#x5199;&#x3002;</p>
</li>
<li><p>&#x53D1;&#x5E03;&#x8BED;&#x8A00;(Published Language)</p>
<p>  &#x5728;&#x4E24;&#x4E2A;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x4E4B;&#x95F4;&#x7684;&#x4E00;&#x79CD;&#x516C;&#x7528;&#x7684;&#x7FFB;&#x8BD1;&#x8BED;&#x8A00;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x53D1;&#x5E03;&#x8BED;&#x8A00;&#x5B8C;&#x6210;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x4E4B;&#x95F4;&#x7684;&#x96C6;&#x6210;&#xFF0C;&#x4E00;&#x822C;&#x4F1A;&#x548C;&#x5F00;&#x653E;&#x4E3B;&#x673A;&#x670D;&#x52A1;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#x3002;</p>
<p>  &#x53D1;&#x5E03;&#x8BED;&#x8A00;&#x53EF;&#x4EE5;&#x662F;<code>XML</code>&#x3001;<code>Protocol Buffers</code>&#x3001;<code>Json</code>&#x7B49;&#x3002;</p>
<p>  PS&#xFF1A;&#x53EF;&#x4F7F;&#x7528;<code>PL</code>&#x6765;&#x7F29;&#x5199;&#x3002;</p>
</li>
<li><p>&#x53E6;&#x8C0B;&#x4ED6;&#x8DEF;(Separate Ways)</p>
<p>  &#x5982;&#x679C;&#x4E24;&#x4E2A;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x4E0D;&#x5B58;&#x5728;&#x663E;&#x8457;&#x5173;&#x7CFB;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4E0D;&#x8FDB;&#x884C;&#x96C6;&#x6210;&#x3002;</p>
</li>
<li><p>&#x5927;&#x6CE5;&#x7403;(Big Ball of Mud)</p>
<p>  &#x5DF2;&#x6709;&#x7CFB;&#x7EDF;&#x7684;&#x6A21;&#x578B;&#x53EF;&#x80FD;&#x662F;&#x6DF7;&#x4E71;&#x4E0D;&#x582A;&#x7684;&#xFF0C;&#x5176;&#x8FB9;&#x754C;&#x975E;&#x5E38;&#x6A21;&#x7CCA;&#x3002;&#x6B64;&#x65F6;&#x5E94;&#x8BE5;&#x4E3A;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x5212;&#x5B9A;&#x8FB9;&#x754C;&#xFF0C;&#x8FD9;&#x91CC;&#x9762;&#x4FBF;&#x662F;&#x5927;&#x6CE5;&#x7403;&#x3002;&#x6B64;&#x65F6;&#x4E0D;&#x8981;&#x8BD5;&#x56FE;&#x901A;&#x8FC7;&#x590D;&#x6742;&#x7684;&#x5EFA;&#x6A21;&#x624B;&#x6BB5;&#x6765;&#x89E3;&#x51B3;&#x5DF2;&#x6709;&#x7CFB;&#x7EDF;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x662F;&#x8B66;&#x60D5;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x4F1A;&#x8150;&#x8680;&#x5176;&#x5B83;&#x7CFB;&#x7EDF;&#x3002;</p>
</li>
</ul>
<p>&#x4E0B;&#x56FE;&#x662F;&#x300A;&#x5B9E;&#x73B0;&#x9886;&#x57DF;&#x9A71;&#x52A8;&#x300B;&#x4E66;&#x4E2D;&#x4F8B;&#x5B50;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x6620;&#x5C04;&#x56FE;&#xFF1A;</p>
<p><img src="images/collab-ovation-and-id-ovation-and-agile.PNG" alt=""></p>
<p>&#x5176;&#x4E2D;&#x8EAB;&#x4EFD;&#x4E0E;&#x8BBF;&#x95EE;&#x4E0A;&#x4E0B;&#x6587;(Identity and Access Context)&#x3001;&#x534F;&#x4F5C;&#x4E0A;&#x4E0B;&#x6587;(Collaboration Context)&#x662F;&#x654F;&#x6377;&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x4E0A;&#x4E0B;&#x6587;(Agile Project Management Context)&#x7684;&#x4E0A;&#x6E38;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E4B;&#x95F4;&#x901A;&#x8FC7;<code>&#x5F00;&#x653E;&#x4E3B;&#x673A;&#x670D;&#x52A1;+&#x53D1;&#x5E03;&#x8BED;&#x8A00;</code>&#x4EE5;&#x53CA;<code>&#x9632;&#x8150;&#x5C42;</code>&#x8FDB;&#x884C;&#x96C6;&#x6210;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;<code>&#x8EAB;&#x4EFD;&#x4E0E;&#x8BBF;&#x95EE;&#x4E0A;&#x4E0B;&#x6587;</code>&#x4E0E;&#x534F;<code>&#x4F5C;&#x4E0A;&#x4E0B;&#x6587;&#x96C6;&#x6210;</code>&#x7684;&#x793A;&#x610F;&#x56FE;&#xFF1A;</p>
<p><img src="images/integration-between-collaboration-context-and-identity-access-context.PNG" alt=""></p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; hsuloong.github.io 2021 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x7F16;&#x8F91;&#x4E8E;&#xFF1A;
2021-08-29 16:20:20
</span></footer>
<script>console.log("plugin-popup....");document.onclick = function(e){ e.target.tagName === "IMG" && window.open(e.target.src,e.target.src)}</script><style>img{cursor:pointer}</style>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="start-domain-drive-design.html" class="navigation navigation-prev " aria-label="Previous page: 开始领域驱动设计">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="architecture.html" class="navigation navigation-next " aria-label="Next page: 架构设计">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"战略建模","level":"1.2.2","depth":2,"next":{"title":"架构设计","level":"1.2.3","depth":2,"path":"domain-driven-design/notes/architecture.md","ref":"domain-driven-design/notes/architecture.md","articles":[]},"previous":{"title":"开始领域驱动设计","level":"1.2.1","depth":2,"path":"domain-driven-design/notes/start-domain-drive-design.md","ref":"domain-driven-design/notes/start-domain-drive-design.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["-lunr","-search","search-pro","expandable-chapters","splitter","back-to-top-button","-sharing","sharing-plus","tbfed-pagefooter","popup"],"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy hsuloong.github.io 2021","modify_label":"编辑于：","modify_format":"YYYY-MM-DD HH:mm:ss"},"splitter":{},"search-pro":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"popup":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"back-to-top-button":{},"sharing":{"qq":true,"all":["douban","facebook","google","instapaper","linkedin","twitter","weibo","messenger","qq","qzone","viber","whatsapp"],"douban":true,"facebook":true,"weibo":true,"twitter":true,"pocket":true,"google":true,"qzone":true},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"expandable-chapters":{}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"domain-driven-design/notes/strategic-modeling.md","mtime":"2021-08-29T16:20:20.606Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-08-29T16:20:58.626Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

