
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>战术建模 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="architecture.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    README简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../">
            
                <a href="../">
            
                    
                    DDD领域驱动设计
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="start-domain-drive-design.html">
            
                <a href="start-domain-drive-design.html">
            
                    
                    开始领域驱动设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="strategic-modeling.html">
            
                <a href="strategic-modeling.html">
            
                    
                    战略建模
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="architecture.html">
            
                <a href="architecture.html">
            
                    
                    架构设计
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.4" data-path="tactical-modeling.html">
            
                <a href="tactical-modeling.html">
            
                    
                    战术建模
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >战术建模</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h4 id="&#x6218;&#x672F;&#x5EFA;&#x6A21;tactical-modeling">&#x6218;&#x672F;&#x5EFA;&#x6A21;(Tactical Modeling)</h4>
<p>&#x6218;&#x672F;&#x5EFA;&#x6A21;&#x662F;&#x6307;&#x8BBE;&#x8BA1;<code>DDD</code>&#x4E2D;&#x7684;&#x7EC4;&#x6210;&#x6784;&#x9020;&#x5757;&#xFF0C;&#x6BD4;&#x5982;<code>&#x5B9E;&#x4F53;</code>&#x3001;<code>&#x503C;&#x5BF9;&#x8C61;</code>&#x3001;<code>&#x805A;&#x5408;</code>&#x3001;<code>&#x9886;&#x57DF;&#x670D;&#x52A1;</code>&#x3001;<code>&#x9886;&#x57DF;&#x4E8B;&#x4EF6;</code>&#x3001;<code>&#x6A21;&#x5757;</code>&#x3001;<code>&#x8D44;&#x6E90;&#x5E93;</code>&#x3001;<code>&#x5E94;&#x7528;&#x670D;&#x52A1;</code>&#x7B49;&#x3002;</p>
<h4 id="&#x5B9E;&#x4F53;entity">&#x5B9E;&#x4F53;(Entity)</h4>
<p>&#x5728;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x5F00;&#x53D1;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x7C7B;&#x4F1A;&#x5C01;&#x88C5;&#x5BF9;&#x8C61;&#x5C5E;&#x6027;&#x4EE5;&#x53CA;&#x76F8;&#x5E94;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x65F6;&#x6211;&#x4EEC;&#x5982;&#x679C;&#x9700;&#x8981;&#x533A;&#x5206;&#x4E0D;&#x540C;&#x7684;&#x7C7B;&#x5BF9;&#x8C61;&#xFF0C;&#x4FBF;&#x4F1A;&#x5F15;&#x5165;&#x4E00;&#x4E2A;<code>&#x8EAB;&#x4EFD;&#x6807;&#x8BC6;</code>&#xFF0C;&#x4E0D;&#x540C;&#x8EAB;&#x4EFD;&#x6807;&#x8BC6;&#x7684;&#x5BF9;&#x8C61;&#x5B8C;&#x5168;&#x662F;&#x4E24;&#x4E2A;&#x4E1C;&#x897F;&#x3002;</p>
<p>&#x800C;&#x5728;&#x9886;&#x57DF;&#x9A71;&#x52A8;&#x8BBE;&#x8BA1;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x79F0;&#x80FD;&#x591F;&#x533A;&#x5206;&#x7684;&#x4E0D;&#x540C;&#x5BF9;&#x8C61;&#x4E3A;<code>&#x5B9E;&#x4F53;</code>&#x3002;&#x5B9E;&#x4F53;&#x5728;&#x751F;&#x547D;&#x5468;&#x671F;&#x4E2D;&#x53EF;&#x4EE5;&#x5BF9;&#x5185;&#x90E8;&#x5C5E;&#x6027;&#x8FDB;&#x884C;&#x4EFB;&#x4F55;&#x7684;&#x4FEE;&#x6539;&#xFF0C;&#x4F46;&#x662F;&#x4FEE;&#x6539;&#x540E;&#x7684;&#x5B9E;&#x4F53;&#x4F9D;&#x7136;&#x8BA4;&#x4E3A;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x5B9E;&#x4F53;&#x3002;</p>
<p>&#x6839;&#x636E;&#x4E0A;&#x8FF0;&#x63CF;&#x8FF0;&#xFF0C;&#x5B9E;&#x4F53;&#x6709;&#x4E24;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x7279;&#x70B9;&#xFF1A;1. <code>&#x552F;&#x4E00;&#x8EAB;&#x4EFD;&#x6807;&#x8BC6;(Unique Identity)</code>&#xFF1B;2.<code>&#x53EF;&#x53D8;&#x6027;(Mutability Characteristics)</code>&#x3002;</p>
<p>&#x6709;&#x4E86;&#x5B9E;&#x4F53;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x540E;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x600E;&#x4E48;&#x6765;&#x521B;&#x5EFA;&#x5B9E;&#x4F53;&#x7684;<code>&#x8EAB;&#x4EFD;&#x6807;&#x8BC6;</code>&#x3002;&#x300A;&#x5B9E;&#x73B0;&#x9886;&#x57DF;&#x9A71;&#x52A8;&#x8BBE;&#x8BA1;&#x300B;&#x4E00;&#x4E66;&#x4E2D;&#x7ED9;&#x9664;&#x4E86;&#x51E0;&#x79CD;&#x5E38;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#xFF1A;</p>
<p>&#xFF08;1&#xFF09;&#x7531;&#x6237;&#x63D0;&#x4F9B;&#x521D;&#x59CB;&#x503C;&#x552F;&#x4E00;&#x503C;</p>
<p>&#x6BD4;&#x5982;&#x5FAE;&#x4FE1;&#x6CE8;&#x518C;&#x7531;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x5FAE;&#x4FE1;&#x53F7;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x975E;&#x5E38;&#x76F4;&#x63A5;&#xFF0C;&#x4F46;&#x5374;&#x5341;&#x5206;&#x4F9D;&#x8D56;&#x4E8E;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x7684;<strong>&#x9AD8;&#x8D28;&#x91CF;</strong>&#x6807;&#x8BC6;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x540E;&#x671F;&#x5BFC;&#x81F4;&#x590D;&#x6742;&#x6027;&#x7684;&#x539F;&#x56E0;&#x4E4B;&#x4E00;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x540E;&#x671F;&#x7528;&#x6237;&#x60F3;&#x4FEE;&#x6539;&#x6807;&#x8BC6;&#x6216;&#x8BB8;&#x5C06;&#x662F;&#x4E00;&#x4EF6;&#x5341;&#x5206;&#x56F0;&#x96BE;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#xFF08;2&#xFF09;&#x7A0B;&#x5E8F;&#x5185;&#x90E8;&#x901A;&#x8FC7;&#x67D0;&#x79CD;&#x7B97;&#x6CD5;&#x81EA;&#x52A8;&#x751F;&#x6210;</p>
<p>&#x6BD4;&#x5982;<code>UUID</code>&#x548C;<code>GUID</code>&#x3002;&#x8FD9;&#x4E9B;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5982;<code>java.util.UUID</code>&#x5E93;&#x6216;&#x8005;<code>Snowflake</code>&#x7B49;&#x552F;&#x4E00;ID&#x751F;&#x6210;&#x7B97;&#x6CD5;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x4E00;&#x822C;&#x5EFA;&#x8BAE;&#x7528;&#x503C;&#x5BF9;&#x8C61;&#x6765;&#x7EF4;&#x62A4;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#xFF0C;&#x56E0;&#x4E3A;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x91CC;&#x9762;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x7EC6;&#x8282;&#x4FE1;&#x606F;&#xFF0C;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x503C;&#x5BF9;&#x8C61;&#x63A5;&#x53E3;&#x66B4;&#x9732;&#x7ED9;&#x5916;&#x90E8;&#x3002;</p>
<p>PS&#xFF1A;&#x7A0B;&#x5E8F;&#x751F;&#x6210;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x5EFA;&#x8BAE;&#x5728;<code>&#x8D44;&#x6E90;&#x5E93;</code>&#x4E2D;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#xFF08;3&#xFF09;&#x6301;&#x4E45;&#x5316;&#x5B58;&#x50A8;&#x673A;&#x5236;&#x751F;&#x6210;</p>
<p>&#x6BD4;&#x5982;Mysql&#x7684;<code>&#x81EA;&#x589E;ID</code>&#x3002;</p>
<p>&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4E00;&#x5F20;&#x8868;&#x4E13;&#x95E8;&#x7528;&#x4E8E;&#x751F;&#x6210;<code>&#x81EA;&#x589E;ID</code>&#x3002;</p>
<p>&#xFF08;4&#xFF09;&#x7531;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x751F;&#x6210;</p>
<p>&#x6BD4;&#x5982;&#x5185;&#x90E8;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#x4F1A;&#x4F7F;&#x7528;&#x67D0;&#x4E2A;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x5DF2;&#x7ECF;&#x5B9A;&#x4E49;&#x597D;&#x7684;&#x6807;&#x8BC6;&#x3002;</p>
<p>&#x4E3E;&#x4E2A;&#x6817;&#x5B50;&#xFF1A;&#x7528;&#x6237;&#x901A;&#x8FC7;&#x8F93;&#x5165;&#x624B;&#x673A;&#x53F7;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x8FD9;&#x4E2A;&#x624B;&#x673A;&#x53F7;&#x67E5;&#x627E;&#x7528;&#x6237;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x3002;</p>
<p>&#x5728;&#x89E3;&#x51B3;&#x4E86;<code>&#x552F;&#x4E00;&#x6807;&#x8BC6;</code>&#x7684;&#x751F;&#x6210;&#x65B9;&#x6CD5;&#x540E;&#xFF0C;&#x4E0B;&#x9762;&#x4E00;&#x4E2A;&#x9700;&#x8981;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x4F55;&#x65F6;&#x751F;&#x6210;&#x4E86;&#x3002;&#x4E00;&#x822C;&#x4F1A;&#x6709;&#x5982;&#x4E0B;&#x65F6;&#x95F4;&#x8282;&#x70B9;&#xFF1A;</p>
<p>&#xFF08;1&#xFF09;&#x6301;&#x4E45;&#x5316;&#x524D;</p>
<p>&#x5728;&#x6301;&#x4E45;&#x5316;&#x4E4B;&#x524D;&#x5982;&#x679C;&#x4F60;&#x9700;&#x8981;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x6765;&#x5B8C;&#x6210;&#x4E00;&#x4E9B;&#x5DE5;&#x4F5C;&#xFF08;&#x6BD4;&#x5982;&#x5BF9;&#x5916;&#x53D1;&#x5E03;&#x9886;&#x57DF;&#x4E8B;&#x4EF6;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x5FC5;&#x987B;&#x5728;&#x6301;&#x4E45;&#x5316;&#x524D;&#x5C31;&#x751F;&#x6210;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x3002;</p>
<p>&#xFF08;2&#xFF09;&#x6301;&#x4E45;&#x5316;&#x540E;</p>
<p>&#x6BD4;&#x5982;&#x5B8C;&#x5168;&#x91C7;&#x7528;&#x6570;&#x636E;&#x5E93;&#x6765;&#x5E2E;&#x52A9;&#x4F60;&#x751F;&#x6210;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x4E00;&#x65E6;&#x751F;&#x6210;&#xFF0C;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x90FD;&#x4E0D;&#x5E94;&#x8BE5;&#x88AB;&#x4FEE;&#x6539;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x9700;&#x8981;&#x5728;&#x6574;&#x4E2A;&#x5B9E;&#x4F53;&#x751F;&#x547D;&#x5468;&#x671F;&#x4E2D;&#x4FDD;&#x6301;&#x6807;&#x8BC6;&#x7684;&#x7A33;&#x5B9A;&#x6027;&#x3002;</p>
<p>&#x786E;&#x4FDD;&#x5B9E;&#x4F53;&#x552F;&#x4E00;&#x7684;&#x95EE;&#x9898;&#x89E3;&#x51B3;&#x540E;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x5C31;&#x662F;&#x4E30;&#x5BCC;&#x5B9E;&#x4F53;&#x7684;&#x5C5E;&#x6027;&#x548C;&#x884C;&#x4E3A;&#x4E86;&#xFF0C;&#x5728;<code>&#x6218;&#x7565;&#x5EFA;&#x6A21;</code>&#x4E2D;&#xFF0C;&#x6574;&#x4E2A;&#x56E2;&#x961F;&#x5DF2;&#x7ECF;&#x5F00;&#x53D1;&#x51FA;&#x4E86;<code>&#x901A;&#x7528;&#x8BED;&#x8A00;</code>&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x52A8;&#x8BCD;&#x3001;&#x540D;&#x8BCD;&#x3001;&#x5F62;&#x5BB9;&#x8BCD;&#x3002;&#x4ECE;&#x8FD9;&#x4E9B;&#x8BCD;&#x8BED;&#x4E4B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4FBF;&#x80FD;&#x5206;&#x6790;&#x51FA;&#x67D0;&#x4E2A;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x6709;&#x54EA;&#x4E9B;&#x5B9E;&#x4F53;&#x4EE5;&#x53CA;&#x8FD9;&#x4E9B;&#x5B9E;&#x4F53;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x54EA;&#x4E9B;&#x884C;&#x4E3A;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x6709;&#x4E00;&#x53E5;&#xFF1A;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x7ED9;&#x81EA;&#x5DF1;&#x7684;&#x597D;&#x53CB;&#x53D1;&#x9001;&#x77ED;&#x6D88;&#x606F;&#x3002;</p>
<p>&#x4ECE;&#x8FD9;&#x53E5;&#x8BDD;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x63D0;&#x53D6;&#x51FA;&#x540D;&#x8BCD;&#xFF1A;&#x7528;&#x6237;&#x3001;&#x597D;&#x53CB;&#x3001;&#x77ED;&#x6D88;&#x606F;&#xFF1B;&#x52A8;&#x8BCD;&#xFF1A;&#x53D1;&#x9001;&#x3002;</p>
<p>&#x6839;&#x636E;&#x4E0A;&#x9762;&#x8FD9;&#x53E5;&#x8BDD;&#xFF0C;&#x8FD9;&#x91CC;&#x80AF;&#x5B9A;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x5B9E;&#x4F53;&#xFF1A;&#x7528;&#x6237;&#x3002;</p>
<p>&#x7136;&#x540E;&#x5C31;&#x662F;&#x6839;&#x636E;&#x901A;&#x7528;&#x8BED;&#x8A00;&#x8BBE;&#x8BA1;&#x5B9E;&#x4F53;&#x5C5E;&#x6027;&#xFF0C;&#x518D;&#x63A5;&#x4E0B;&#x6765;&#x5C31;&#x662F;&#x6316;&#x6398;&#x5B9E;&#x4F53;&#x7684;&#x5173;&#x952E;&#x884C;&#x4E3A;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x7528;&#x6237;&#x6709;&#x4E00;&#x4E2A;&#x597D;&#x53CB;&#x5217;&#x8868;&#x3001;&#x6709;&#x624B;&#x673A;&#x53F7;&#x7B49;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x7528;&#x6237;&#x5C5E;&#x6027;&#x3002;</p>
<p>&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x6DFB;&#x52A0;&#x597D;&#x53CB;&#xFF0C;&#x53EF;&#x4EE5;&#x5220;&#x9664;&#x597D;&#x53CB;&#xFF0C;&#x53EF;&#x4EE5;&#x7ED9;&#x597D;&#x53CB;&#x53D1;&#x6D88;&#x606F;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x7528;&#x6237;&#x5B9E;&#x4F53;&#x7684;&#x5173;&#x952E;&#x884C;&#x4E3A;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x4E0D;&#x505C;&#x7684;&#x6C9F;&#x901A;&#x8BA8;&#x8BBA;&#x4EE5;&#x53CA;&#x968F;&#x7740;&#x56E2;&#x961F;&#x5BF9;&#x6A21;&#x578B;&#x4E86;&#x89E3;&#x7684;&#x6DF1;&#x5165;&#xFF0C;&#x5B9E;&#x4F53;&#x7684;&#x5185;&#x5BB9;&#x4E5F;&#x5C06;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x4E30;&#x5BCC;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x5B9E;&#x4F53;&#x4E00;&#x822C;&#x662F;&#x901A;&#x8FC7;&#x4E00;&#x4E9B;&#x4F20;&#x5165;&#x53C2;&#x6570;&#x8FDB;&#x884C;&#x521B;&#x5EFA;&#xFF0C;&#x4E3A;&#x4E86;&#x4FDD;&#x8BC1;&#x5B9E;&#x4F53;&#x5404;&#x79CD;&#x5C5E;&#x6027;&#x7684;&#x6709;&#x6548;&#x6027;&#xFF0C;&#x4E00;&#x822C;&#x9700;&#x8981;&#x9A8C;&#x8BC1;&#x5C5E;&#x6027;&#x503C;&#x7684;&#x5408;&#x6CD5;&#x6027;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x9A8C;&#x8BC1;&#x6574;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x5408;&#x6CD5;&#x6027;&#x3002;</p>
<p>&#x9A8C;&#x8BC1;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x5728;&#x6784;&#x9020;&#x51FD;&#x6570;&#x4E2D;&#x9A8C;&#x8BC1;&#xFF0C;&#x5982;&#x679C;&#x9A8C;&#x8BC1;&#x8FC7;&#x7A0B;&#x975E;&#x5E38;&#x590D;&#x6742;&#xFF0C;&#x90A3;&#x4E48;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x5B9A;&#x4E49;&#x4E00;&#x4E9B;&#x8F85;&#x52A9;&#x9A8C;&#x8BC1;Handler&#x6765;&#x8F85;&#x52A9;&#x6821;&#x9A8C;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x4E2A;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x6765;&#x8FDB;&#x884C;&#x9A8C;&#x8BC1;&#x3002;</p>
<h4 id="&#x503C;&#x5BF9;&#x8C61;value-object">&#x503C;&#x5BF9;&#x8C61;(Value Object)</h4>
<p>&#x5728;&#x4E0A;&#x8282;<code>&#x5B9E;&#x4F53;</code>&#x4E2D;&#x6211;&#x4EEC;&#x63D0;&#x5230;&#x4E86;&#x5B9E;&#x4F53;&#x4E24;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x7279;&#x70B9;&#xFF1A;&#x552F;&#x4E00;&#x548C;&#x53EF;&#x53D8;&#x6027;&#x3002;&#x5176;&#x4E2D;&#x552F;&#x4E00;&#x542B;&#x4E49;&#x662F;&#x5C31;&#x7B97;&#x5B9E;&#x4F53;&#x5176;&#x4ED6;&#x5C5E;&#x6027;&#x5B8C;&#x5168;&#x4E00;&#x6837;&#xFF0C;&#x53EA;&#x8981;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x4E0D;&#x4E00;&#x6837;&#x4F9D;&#x7136;&#x8BA4;&#x4E3A;&#x662F;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x4F53;&#xFF1B;&#x53EF;&#x53D8;&#x5219;&#x610F;&#x5473;&#x7740;&#x5B9E;&#x4F53;&#x5185;&#x90E8;&#x5C5E;&#x6027;&#x53EF;&#x4EE5;&#x88AB;&#x4FEE;&#x6539;&#x3002;</p>
<p>&#x800C;&#x503C;&#x5BF9;&#x8C61;&#x5219;&#x521A;&#x597D;&#x76F8;&#x53CD;&#xFF1A;&#x4E0D;&#x53D8;&#x6027;&#x548C;&#x65E0;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x3002;&#x4E0D;&#x53D8;&#x4EE3;&#x8868;&#x503C;&#x5BF9;&#x8C61;&#x4E0D;&#x4F1A;&#x5355;&#x72EC;&#x4FEE;&#x6539;&#x5BF9;&#x8C61;&#x7684;&#x67D0;&#x4E2A;&#x5C5E;&#x6027;&#xFF0C;&#x800C;&#x662F;&#x505A;&#x6574;&#x4F53;&#x66FF;&#x6362;&#xFF1B;&#x65E0;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x5219;&#x610F;&#x5473;&#x7740;&#x53EA;&#x8981;&#x503C;&#x5BF9;&#x8C61;&#x5C5E;&#x6027;&#x5168;&#x90E8;&#x76F8;&#x7B49;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x8BA4;&#x4E3A;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x503C;&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x4E5F;&#x6B63;&#x662F;&#x7531;&#x4E8E;&#x503C;&#x5BF9;&#x8C61;&#x7684;&#x4E0D;&#x53D8;&#x6027;&#xFF0C;&#x56E0;&#x6B64;&#x503C;&#x5BF9;&#x8C61;&#x62F7;&#x8D1D;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x6D45;&#x62F7;&#x8D1D;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x503C;&#x5BF9;&#x8C61;&#x7684;&#x8FD9;&#x4E2A;&#x7279;&#x70B9;&#x53EF;&#x4EE5;&#x7B80;&#x5316;&#x5BF9;&#x503C;&#x5BF9;&#x8C61;&#x7684;&#x4F7F;&#x7528;&#x3002;&#x4E0D;&#x53D8;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x5BF9;&#x503C;&#x5BF9;&#x8C61;&#x7684;&#x4FEE;&#x6539;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x662F;&#x4E00;&#x4E2A;&#x65E0;&#x5BB3;&#x7684;&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x300A;&#x5B9E;&#x73B0;&#x9886;&#x57DF;&#x9A71;&#x52A8;&#x300B;&#x4E00;&#x4E66;&#x4E2D;&#x5BF9;&#x4E8E;&#x662F;&#x5426;&#x5E94;&#x8BE5;&#x5EFA;&#x6A21;&#x6210;&#x503C;&#x5BF9;&#x8C61;&#x7ED9;&#x4E86;&#x4E00;&#x4E9B;&#x539F;&#x5219;&#xFF1A;</p>
<p>&#xFF08;1&#xFF09;It measures, quantifies, or describes a thing in the domain.</p>
<p>&#xFF08;2&#xFF09;It can be maintained as immutable.</p>
<p>&#xFF08;3&#xFF09;It models a conceptual whole by composing related attributes as an integral unit.</p>
<p>&#xFF08;4&#xFF09;It is completely replaceable when the measurement or description changes.</p>
<p>&#xFF08;5&#xFF09;It can be compared with others using Value equality.</p>
<p>&#xFF08;6&#xFF09;It supplies its collaborators with Side-Effect-Free Behavior.</p>
<p>&#x4E00;&#x822C;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x503C;&#x5BF9;&#x8C61;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x6BD4;&#x5982;&#x5730;&#x5740;&#x662F;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5176;&#x7531;&#x56FD;&#x5BB6;&#x3001;&#x7701;&#x3001;&#x5E02;&#x5B57;&#x6BB5;&#x7EC4;&#x6210;&#xFF0C;&#x8FD9;&#x65F6;&#x628A;&#x5730;&#x5740;&#x5EFA;&#x6A21;&#x6210;&#x4E00;&#x4E2A;&#x503C;&#x5BF9;&#x8C61;&#x662F;&#x5408;&#x7406;&#x7684;&#x3002;</p>
<p>&#x5728;&#x503C;&#x5BF9;&#x8C61;&#x4E0A;&#x9762;&#x5B9A;&#x4E49;&#x7684;&#x65B9;&#x6CD5;&#x90FD;&#x662F;<code>&#x65E0;&#x526F;&#x4F5C;&#x7528;&#x51FD;&#x6570;(Side-Effect-Free Function)</code>&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4EFB;&#x4F55;&#x65B9;&#x6CD5;&#x90FD;&#x4E0D;&#x80FD;&#x4FEE;&#x6539;&#x503C;&#x5BF9;&#x8C61;&#x5185;&#x90E8;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x5728;C++&#x4E2D;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x6240;&#x6709;&#x51FD;&#x6570;&#x90FD;&#x662F;<code>const</code>&#x51FD;&#x6570;&#x3002;</p>
<p>&#x9664;&#x4E86;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x4F7F;&#x7528;&#x503C;&#x5BF9;&#x8C61;&#x5916;&#xFF0C;&#x5728;&#x8FDB;&#x884C;&#x4E0A;&#x4E0B;&#x6587;&#x96C6;&#x6210;&#x65F6;&#xFF0C;&#x4E5F;&#x5C3D;&#x91CF;&#x901A;&#x8FC7;&#x503C;&#x5BF9;&#x8C61;&#x53BB;&#x5EFA;&#x6A21;&#x5176;&#x4ED6;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;<code>&#x6700;&#x5C0F;&#x5316;&#x96C6;&#x6210;(Integrate with Minimalism)</code>&#x3002;</p>
<h4 id="&#x805A;&#x5408;aggregate">&#x805A;&#x5408;(Aggregate)</h4>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x4F7F;&#x7528;&#x805A;&#x5408;&#xFF1F;&#x805A;&#x5408;&#x662F;&#x7528;&#x6765;&#x7EC4;&#x6210;&#x4E00;&#x81F4;&#x6027;&#x8FB9;&#x754C;&#x7684;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x64CD;&#x4F5C;&#x90FD;&#x662F;&#x5728;&#x805A;&#x5408;&#x4E0A;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x805A;&#x5408;&#x5185;&#x90E8;&#x518D;&#x534F;&#x8C03;<code>&#x5B9E;&#x4F53;</code>&#x3001;<code>&#x503C;&#x5BF9;&#x8C61;</code>&#x5B8C;&#x6210;&#x76F8;&#x5E94;&#x7684;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x805A;&#x5408;&#x8BBE;&#x8BA1;&#x8FC7;&#x5927;&#x8FC7;&#x5C0F;&#x90FD;&#x4F1A;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x3002;&#x805A;&#x5408;&#x8FC7;&#x5927;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x5E76;&#x53D1;&#x4E0B;&#x964D;&#xFF0C;&#x5176;&#x672C;&#x8EAB;&#x4E5F;&#x5341;&#x5206;&#x81C3;&#x80BF;&#xFF1B;&#x805A;&#x5408;&#x8FC7;&#x5C0F;&#x5219;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#x9886;&#x57DF;&#x5185;&#x5BF9;&#x8C61;&#x7684;&#x72B6;&#x6001;&#x4E00;&#x81F4;&#x6027;&#x3002;</p>
<p>&#x5728;&#x300A;&#x5B9E;&#x73B0;&#x9886;&#x57DF;&#x9A71;&#x52A8;&#x8BBE;&#x8BA1;&#x300B;&#x4E00;&#x4E66;&#x4E2D;&#x7ED9;&#x51FA;&#x4E86;&#x51E0;&#x4E2A;&#x8BBE;&#x8BA1;&#x805A;&#x5408;&#x7684;&#x539F;&#x5219;&#xFF1A;</p>
<p>&#xFF08;1&#xFF09;Model True Invariants in Consistency Boundaries</p>
<p>&#x5728;&#x4E00;&#x81F4;&#x6027;&#x8FB9;&#x754C;&#x4E4B;&#x5185;&#x5EFA;&#x6A21;&#x771F;&#x6B63;&#x7684;&#x4E0D;&#x53D8;&#x6761;&#x4EF6;&#x3002;&#x4E0D;&#x53D8;&#x6761;&#x4EF6;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x4E1A;&#x52A1;&#x89C4;&#x5219;&#x59CB;&#x7EC8;&#x662F;&#x4E00;&#x81F4;&#x7684;(An invariant is a business rule that must always be consistent)&#x3002;</p>
<p>&#x4E00;&#x81F4;&#x6027;&#x5728;&#x8FD9;&#x91CC;&#x4E3B;&#x8981;&#x662F;&#x4E8B;&#x52A1;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5728;&#x6301;&#x4E45;&#x5316;&#x4E2D;&#x4F7F;&#x7528;&#x5355;&#x4E8B;&#x52A1;&#x6765;&#x7BA1;&#x7406;&#x805A;&#x5408;&#x7684;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x5373;&#x5728;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E2D;&#x53EA;&#x4F1A;&#x4FEE;&#x6539;&#x4E00;&#x4E2A;&#x805A;&#x5408;&#x3002;</p>
<p>&#xFF08;2&#xFF09;Design Small Aggregates</p>
<p>&#x8BBE;&#x8BA1;&#x5C0F;&#x805A;&#x5408;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E5F;&#x7B26;&#x5408;&#x8F6F;&#x4EF6;&#x4E16;&#x754C;&#x7684;&#x590D;&#x6742;&#x95EE;&#x9898;&#x5206;&#x89E3;&#x6210;&#x7B80;&#x5355;&#x5C0F;&#x7684;&#x95EE;&#x9898;&#x6765;&#x89E3;&#x51B3;&#x3002;&#x6B63;&#x5982;&#x524D;&#x9762;&#x6240;&#x8BF4;&#xFF0C;&#x805A;&#x5408;&#x8FC7;&#x5927;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x6301;&#x4E45;&#x5316;&#x6027;&#x80FD;&#x53D7;&#x5230;&#x5F71;&#x54CD;&#xFF0C;&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x5F71;&#x54CD;&#x5C06;&#x805A;&#x5408;&#x52A0;&#x8F7D;&#x5230;&#x5185;&#x5B58;&#x7684;&#x901F;&#x5EA6;&#x3002;</p>
<p>&#xFF08;3&#xFF09;Reference Other Aggregates by Identity</p>
<p>&#x901A;&#x8FC7;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x5F15;&#x7528;&#x5176;&#x4ED6;&#x805A;&#x5408;&#x3002;&#x4E0D;&#x8981;&#x91C7;&#x7528;&#x7EC4;&#x5408;&#x7684;&#x65B9;&#x5F0F;&#x76F4;&#x63A5;&#x5F15;&#x7528;&#x5176;&#x4ED6;&#x805A;&#x5408;&#xFF0C;&#x800C;&#x662F;&#x91C7;&#x7528;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x8FD9;&#x6837;&#x4E5F;&#x95F4;&#x63A5;&#x8868;&#x660E;&#x6211;&#x4EEC;&#x4E0D;&#x4F1A;&#x5728;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E2D;&#x4FEE;&#x6539;&#x591A;&#x4E2A;&#x805A;&#x5408;&#x3002;</p>
<p>&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x53EF;&#x4EE5;&#x5728;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x4E2D;&#x6765;&#x5904;&#x7406;&#x805A;&#x5408;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF0C;&#x4EE5;&#x907F;&#x514D;&#x5728;&#x805A;&#x5408;&#x4E2D;&#x4F7F;&#x7528;&#x8D44;&#x6E90;&#x5E93;&#x6216;&#x8005;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x3002;</p>
<p>&#xFF08;4&#xFF09;Use Eventual Consistency Outside the Boundary</p>
<p>&#x5728;&#x805A;&#x5408;&#x5916;&#x754C;&#x4E4B;&#x5916;&#x4F7F;&#x7528;&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#x3002;&#x4E0A;&#x9762;&#x5199;&#x5230;&#x4E0D;&#x8981;&#x5728;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E2D;&#x4FEE;&#x6539;&#x591A;&#x4E2A;&#x805A;&#x5408;&#xFF0C;&#x90A3;&#x4E48;&#x5982;&#x679C;&#x7528;&#x6237;&#x547D;&#x4EE4;&#x786E;&#x5B9E;&#x9700;&#x8981;&#x591A;&#x4E2A;&#x805A;&#x5408;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6D88;&#x606F;&#x6765;&#x4F7F;&#x5F97;&#x591A;&#x4E2A;&#x805A;&#x5408;&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x3002;&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x4F1A;&#x5B58;&#x5728;&#x4E00;&#x5B9A;&#x7684;&#x5EF6;&#x8FDF;&#xFF0C;&#x8FD9;&#x4E2A;&#x9700;&#x8981;&#x8003;&#x8651;&#x80FD;&#x5426;&#x63A5;&#x53D7;&#x8FD9;&#x4E2A;&#x5EF6;&#x8FDF;&#x3002;</p>
<p>&#x5173;&#x4E8E;&#x4F7F;&#x7528;&#x4E8B;&#x52A1;&#x4E00;&#x81F4;&#x6216;&#x8005;&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x539F;&#x5219;&#x53EF;&#x4F9B;&#x53C2;&#x8003;&#xFF1A;</p>
<pre><code>When examining the use case (or story), ask whether it&#x2019;s the job of the user
executing the use case to make the data consistent. If it is, try to make it transactionally consistent,
but only by adhering to the other rules of Aggregates.
If it is another user&#x2019;s job, or the job of the system, allow it to be eventually consistent.
</code></pre><p>&#x867D;&#x7136;&#x539F;&#x5219;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x53C2;&#x8003;&#x6807;&#x51C6;&#xFF0C;&#x4F46;&#x662F;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x603B;&#x6709;&#x4F8B;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x6253;&#x7834;&#x4E0A;&#x8FF0;&#x539F;&#x5219;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x6709;&#x4E00;&#x4E9B;&#x5145;&#x8DB3;&#x7684;&#x7406;&#x7531;&#xFF1A;</p>
<p>&#xFF08;1&#xFF09;User Interface Convenience</p>
<p>&#x4E3A;&#x4E86;&#x7528;&#x6237;&#x65B9;&#x4FBF;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x7528;&#x6237;&#x4E3A;&#x672C;&#x3002;</p>
<p>&#xFF08;2&#xFF09;Lack of Technical Mechanisms</p>
<p>&#x7F3A;&#x4E4F;&#x6280;&#x672F;&#x673A;&#x5236;&#xFF0C;&#x6BD5;&#x7ADF;&#x5DE7;&#x5987;&#x96BE;&#x4E3A;&#x65E0;&#x7C73;&#x4E4B;&#x708A;&#x3002;</p>
<p>&#xFF08;3&#xFF09;Global Transactions</p>
<p>&#x9700;&#x8981;&#x5168;&#x5C40;&#x4E8B;&#x52A1;&#xFF0C;&#x5728;&#x5F88;&#x591A;&#x91D1;&#x878D;&#x9886;&#x57DF;&#x53EF;&#x80FD;&#x4F1A;&#x7528;&#x5230;&#x3002;</p>
<p>&#xFF08;4&#xFF09;Query Performance</p>
<p>&#x4E3A;&#x4E86;&#x67E5;&#x8BE2;&#x6027;&#x80FD;&#xFF0C;&#x59A5;&#x534F;&#x4E0E;&#x5E73;&#x8861;&#x7684;&#x827A;&#x672F;&#x3002;</p>
<h4 id="&#x9886;&#x57DF;&#x670D;&#x52A1;domain-service">&#x9886;&#x57DF;&#x670D;&#x52A1;(Domain Service)</h4>
<p><code>&#x9886;&#x57DF;&#x670D;&#x52A1;</code>&#x5E94;&#x5F53;&#x662F;&#x65E0;&#x72B6;&#x6001;&#x7684;&#xFF0C;&#x5F53;&#x67D0;&#x4E2A;&#x64CD;&#x4F5C;&#x4E0D;&#x9002;&#x5408;&#x653E;&#x5728;<code>&#x805A;&#x5408;</code>&#x3001;<code>&#x5B9E;&#x4F53;</code>&#x6216;&#x8005;<code>&#x503C;&#x5BF9;&#x8C61;</code>&#x4E0A;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x3002;&#x548C;<code>&#x5E94;&#x7528;&#x670D;&#x52A1;</code>&#x4E0D;&#x540C;&#xFF0C;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x662F;&#x542B;&#x6709;<code>&#x4E1A;&#x52A1;&#x903B;&#x8F91;</code>&#x7684;&#x3002;</p>
<p>&#x4E00;&#x822C;&#x800C;&#x8A00;&#xFF0C;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x4E00;&#x5B9A;&#x9700;&#x8981;&#x8FDC;&#x7A0B;&#x3001;&#x91CD;&#x91CF;&#x7EA7;&#x7684;&#x4E8B;&#x52A1;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x4E66;&#x4E2D;&#x7ED9;&#x51FA;&#x4E86;&#x4E00;&#x4E9B;&#x5224;&#x65AD;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x662F;&#x5426;&#x9700;&#x8981;&#x7528;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x6765;&#x627F;&#x8F7D;&#x7684;&#x601D;&#x8003;&#x70B9;&#xFF1A;</p>
<p>&#xFF08;1&#xFF09;Perform a significant business process
&#xFF08;2&#xFF09;Transform a domain object from one composition to another
&#xFF08;3&#xFF09;Calculate a Value requiring input from more than one domain object</p>
<p>&#x5728;&#x5177;&#x4F53;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x4E0D;&#x8981;&#x8FC7;&#x5EA6;&#x4F7F;&#x7528;&#x9886;&#x57DF;&#x670D;&#x52A1;&#xFF0C;&#x800C;&#x662F;&#x5728;&#x5FC5;&#x8981;&#x7684;&#x65F6;&#x5019;&#x624D;&#x4F7F;&#x7528;&#xFF0C;&#x5426;&#x5219;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;<code>&#x8D2B;&#x8840;&#x6A21;&#x578B;</code>&#x3002;&#x81F3;&#x4E8E;&#x600E;&#x4E48;&#x5224;&#x65AD;&#x662F;&#x5426;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x9886;&#x57DF;&#x670D;&#x52A1;&#xFF0C;&#x9664;&#x4E86;&#x53C2;&#x8003;&#x4E0A;&#x9762;&#x7684;&#x51C6;&#x5219;&#xFF0C;&#x4E5F;&#x4F1A;&#x968F;&#x7740;&#x56E2;&#x961F;&#x5BF9;&#x6A21;&#x578B;&#x7684;&#x8FDB;&#x4E00;&#x6B65;&#x6DF1;&#x5165;&#x7406;&#x89E3;&#x800C;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x3002;</p>
<p>&#x5728;&#x7F16;&#x7801;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5224;&#x65AD;&#x67D0;&#x4E2A;&#x64CD;&#x4F5C;&#x662F;&#x5426;&#x9002;&#x5408;&#x653E;&#x5728;&#x5B9E;&#x4F53;&#x6216;&#x8005;&#x805A;&#x5408;&#x91CC;&#x9762;&#x53EF;&#x4EE5;&#x501F;&#x9274;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x7684;<code>SOLID</code>&#x539F;&#x5219;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x53EF;&#x80FD;&#x8FDD;&#x80CC;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x65F6;&#x5019;&#x5C31;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x662F;&#x5426;&#x5E94;&#x8BE5;&#x653E;&#x5728;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x4E2D;&#x4E86;&#x3002;</p>
<h4 id="&#x9886;&#x57DF;&#x4E8B;&#x4EF6;domain-event">&#x9886;&#x57DF;&#x4E8B;&#x4EF6;(Domain Event)</h4>
<p>&#x9886;&#x57DF;&#x4E8B;&#x4EF6;&#xFF0C;&#x5C31;&#x662F;&#x9886;&#x57DF;&#x4E13;&#x5BB6;&#x6240;&#x5173;&#x5FC3;&#x7684;&#x53D1;&#x751F;&#x5728;&#x9886;&#x57DF;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x4E8B;&#x4EF6;&#xFF0C;&#x6BD4;&#x5982;&#x5BF9;&#x4E8E;&#x5FAE;&#x4FE1;&#x6CE8;&#x518C;&#xFF0C;&#x9886;&#x57DF;&#x4E13;&#x5BB6;&#x53EF;&#x80FD;&#x5173;&#x5FC3;&#x7528;&#x6237;<code>&#x6CE8;&#x518C;&#x6210;&#x529F;</code>&#x8FD9;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#xFF0C;&#x90A3;&#x4E48;&#x6CE8;&#x518C;&#x6210;&#x529F;&#x5C31;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x662F;&#x9886;&#x57DF;&#x4E8B;&#x4EF6;&#x3002;</p>
<p>&#x9886;&#x57DF;&#x4E8B;&#x4EF6;&#x4EA7;&#x751F;&#x540E;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x672C;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x6D88;&#x8D39;&#xFF0C;&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x662F;&#x88AB;&#x5176;&#x4ED6;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x6D88;&#x8D39;&#x3002;&#x4E0B;&#x56FE;&#x4E3A;&#x300A;&#x5B9E;&#x73B0;&#x9886;&#x57DF;&#x9A71;&#x52A8;&#x8BBE;&#x8BA1;&#x300B;&#x4E00;&#x4E66;&#x4E2D;&#x9886;&#x57DF;&#x4E8B;&#x4EF6;&#x4E00;&#x4E2A;&#x62BD;&#x8C61;&#x7684;&#x6D41;&#x8F6C;&#x56FE;&#xFF1A;</p>
<p><img src="images/domain-event.PNG" alt=""></p>
<p>&#x56FE;&#x4E2D;&#x9886;&#x57DF;&#x4E8B;&#x4EF6;&#x7531;<code>&#x805A;&#x5408;</code>&#x53D1;&#x5E03;&#xFF0C;&#x7ECF;&#x8FC7;&#x8F6C;&#x50A8;&#x6700;&#x540E;&#x88AB;&#x8FDC;&#x7AEF;&#x8BA2;&#x9605;&#x8005;&#x6D88;&#x8D39;&#x3002;</p>
<p>&#x9886;&#x57DF;&#x4E8B;&#x4EF6;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x7B80;&#x5316;&#x7CFB;&#x7EDF;&#xFF0C;&#x5C06;&#x4E00;&#x4E9B;&#x7CFB;&#x5217;&#x7684;&#x64CD;&#x4F5C;&#x62C6;&#x5206;&#x6210;&#x591A;&#x4E2A;&#x7C92;&#x5EA6;&#x8F83;&#x5C0F;&#x7684;&#x5904;&#x7406;&#x5355;&#x5143;&#x3002;</p>
<p>&#x6709;&#x4E00;&#x4E9B;&#x9886;&#x57DF;&#x4E8B;&#x4EF6;&#x5982;&#x679C;&#x4E0D;&#x662F;&#x7531;<code>&#x805A;&#x5408;</code>&#x4E2D;&#x7684;&#x547D;&#x4EE4;&#x64CD;&#x4F5C;&#x4EA7;&#x751F;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x4EE5;&#x628A;&#x4E8B;&#x4EF6;&#x5EFA;&#x6A21;&#x6210;&#x4E00;&#x4E2A;<code>&#x805A;&#x5408;</code>&#xFF0C;&#x540C;&#x65F6;&#x53EF;&#x4EE5;&#x62E5;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x8D44;&#x6E90;&#x5E93;&#x3002;&#x8FD9;&#x79CD;&#x9886;&#x57DF;&#x4E8B;&#x4EF6;&#x53EF;&#x4EE5;&#x7531;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x4EA7;&#x751F;&#xFF0C;&#x7136;&#x540E;&#x6DFB;&#x52A0;&#x5230;&#x8D44;&#x6E90;&#x5E93;&#x4E2D;&#x540E;&#x7531;&#x6D88;&#x606F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x8FDB;&#x884C;&#x53D1;&#x5E03;&#x3002;</p>
<p>&#x4E00;&#x822C;&#x800C;&#x8A00;&#xFF0C;&#x9886;&#x57DF;&#x4E8B;&#x4EF6;&#x5EFA;&#x6A21;&#x6210;&#x805A;&#x5408;&#x540E;&#x9700;&#x8981;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x7684;&#x4E8B;&#x4EF6;&#x6807;&#x8BC6;&#xFF0C;&#x5B9E;&#x8DF5;&#x4E2D;&#x8FD9;&#x4E2A;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x53EF;&#x80FD;&#x662F;&#x6839;&#x636E;&#x5C5E;&#x6027;&#x8BA1;&#x7B97;&#x5F97;&#x5230;&#x7684;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x672C;&#x5730;&#x53D1;&#x5E03;&#x4EE5;&#x53CA;&#x6D88;&#x8D39;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#xFF0C;&#x540C;&#x65F6;&#x5728;<code>&#x5E94;&#x7528;&#x670D;&#x52A1;</code>&#x4E2D;&#x6CE8;&#x518C;&#x8BA2;&#x9605;&#x8005;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x8FDC;&#x7AEF;&#x8BA2;&#x9605;&#x8005;&#xFF0C;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x53EF;&#x80FD;&#x4F1A;&#x63D0;&#x4F9B;&#x6D88;&#x606F;&#x4E2D;&#x95F4;&#x4EF6;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x8FC7;&#x4E24;&#x6BB5;&#x5F0F;&#x4E8B;&#x52A1;&#x5B8C;&#x6210;&#x9886;&#x57DF;&#x4E8B;&#x4EF6;&#x7684;&#x53D1;&#x5E03;&#xFF08;&#x56E0;&#x4E3A;&#x9700;&#x8981;&#x4FDD;&#x8BC1;&#x805A;&#x5408;&#x6301;&#x4E45;&#x5316;&#x5B58;&#x50A8;&#x4EE5;&#x53CA;&#x6D88;&#x606F;&#x4E2D;&#x95F4;&#x4EF6;&#x6301;&#x4E45;&#x5316;&#x5B58;&#x50A8;&#x7684;&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x7531;&#x6D88;&#x606F;&#x4E2D;&#x95F4;&#x4EF6;&#x63A8;&#x9001;&#x9886;&#x57DF;&#x4E8B;&#x4EF6;&#x7ED9;&#x6CE8;&#x518C;&#x7684;&#x8BA2;&#x9605;&#x8005;&#x3002;</p>
<p>&#x6700;&#x540E;&#x5173;&#x4E8E;&#x9886;&#x57DF;&#x4E8B;&#x4EF6;&#x8981;&#x8BF4;&#x7684;&#x5C31;&#x662F;&#x4E8B;&#x4EF6;&#x53BB;&#x91CD;&#x3002;&#x4E8B;&#x4EF6;&#x53BB;&#x91CD;&#x5305;&#x542B;&#x4E24;&#x5C42;&#x542B;&#x4E49;&#xFF1A;1.&#x53D1;&#x5E03;&#x8005;&#x53BB;&#x91CD;&#xFF1B;2.&#x6D88;&#x8D39;&#x8005;&#x53BB;&#x91CD;&#x3002;</p>
<p>&#x53D1;&#x5E03;&#x8005;&#x53BB;&#x91CD;&#x4E3B;&#x8981;&#x662F;&#x53D1;&#x5E03;&#x8005;&#x80FD;&#x901A;&#x8FC7;&#x4E00;&#x5B9A;&#x7684;&#x624B;&#x6BB5;&#x65B9;&#x5F0F;&#x91CD;&#x590D;&#x53D1;&#x9001;&#x6D88;&#x606F;&#xFF0C;&#x6BD4;&#x5982;&#x901A;&#x8FC7;&#x6D88;&#x606F;&#x7684;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x6765;&#x53BB;&#x91CD;&#xFF1B;&#x6D88;&#x8D39;&#x8005;&#x53BB;&#x91CD;&#x4E00;&#x822C;&#x662F;&#x6307;&#x6D88;&#x8D39;&#x8005;&#x80FD;&#x591F;&#x505A;&#x5230;&#x6D88;&#x8D39;&#x591A;&#x6761;&#x4E00;&#x6837;&#x7684;&#x6D88;&#x606F;&#x6700;&#x540E;&#x7ED3;&#x679C;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6D88;&#x8D39;&#x662F;<code>&#x5E42;&#x7B49;</code>&#x7684;&#x3002;</p>
<h4 id="&#x6A21;&#x5757;modules">&#x6A21;&#x5757;(Modules)</h4>
<p>&#x5728;DDD&#x4E2D;&#xFF0C;&#x6A21;&#x5757;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x7EC4;&#x7EC7;&#x6A21;&#x578B;&#x4EE3;&#x7801;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5404;&#x79CD;&#x7C7B;&#x662F;&#x600E;&#x4E48;&#x7EC4;&#x7EC7;&#x4FDD;&#x5B58;&#x7684;&#x3002;&#x6A21;&#x5757;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x67D0;&#x4E9B;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x91CC;&#x9762;&#x7684;<code>&#x5305;</code>&#x6216;&#x8005;<code>&#x547D;&#x540D;&#x7A7A;&#x95F4;</code>&#x3002;&#x5728;&#x8BBE;&#x8BA1;&#x6A21;&#x5757;&#x540D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5E94;&#x8BE5;&#x80FD;&#x5145;&#x5206;&#x53CD;&#x6620;&#x9886;&#x57DF;&#x4E2D;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x53CD;&#x6620;&#x901A;&#x7528;&#x8BED;&#x8A00;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x300A;&#x5B9E;&#x73B0;&#x9886;&#x57DF;&#x9A71;&#x52A8;&#x8BBE;&#x8BA1;&#x300B;&#x4E00;&#x4E66;&#x4E2D;&#x8BBE;&#x8BA1;&#x6A21;&#x5757;&#x7684;&#x7B80;&#x5355;&#x539F;&#x5219;&#xFF1A;</p>
<p><img src="images/simple-rules-for-module-design.PNG" alt="">
<img src="images/simple-rules-for-module-design-continued.PNG" alt=""></p>
<p>&#x8BBE;&#x8BA1;&#x6A21;&#x5757;&#x53CA;&#x5176;&#x547D;&#x540D;&#x9700;&#x8981;&#x7ED9;&#x4E88;&#x4E0E;&#x8BBE;&#x8BA1;<code>&#x5B9E;&#x4F53;</code>&#x3001;<code>&#x503C;&#x5BF9;&#x8C61;</code>&#x7B49;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x540C;&#x6837;&#x7684;&#x91CD;&#x89C6;&#x7A0B;&#x5EA6;&#xFF0C;&#x4FDD;&#x6301;&#x6A21;&#x5757;&#x7684;&#x6574;&#x6D01;&#x3002;</p>
<p>&#x5982;&#x679C;&#x501F;&#x7528;C++&#x4E2D;&#x7684;<code>namespace</code>&#x6982;&#x5FF5;&#xFF0C;&#x90A3;&#x4E48;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x7EC4;&#x7EC7;&#x5982;&#x4E0B;&#xFF08;&#x5047;&#x8BBE;&#x516C;&#x53F8;&#x57DF;&#x540D;awesome.com&#xFF09;&#xFF1A;</p>
<pre><code class="lang-cpp"><span class="hljs-keyword">namespace</span> com {
  <span class="hljs-keyword">namespace</span> awesome {
    <span class="hljs-keyword">namespace</span> context_boundary_a {
      <span class="hljs-keyword">namespace</span> domain {
        <span class="hljs-keyword">namespace</span> model {
            <span class="hljs-comment">// &#x8FD9;&#x91CC;&#x5B9A;&#x4E49;&#x5B9E;&#x73B0;&#x5B9E;&#x4F53;&#x3001;&#x805A;&#x5408;&#x3001;&#x503C;&#x5BF9;&#x8C61;&#x3001;&#x9886;&#x57DF;&#x4E8B;&#x4EF6;&#x7B49;&#x9886;&#x57DF;&#x5BF9;&#x8C61;</span>
        }
        <span class="hljs-keyword">namespace</span> service {
            <span class="hljs-comment">// &#x8FD9;&#x91CC;&#x5B9A;&#x4E49;&#x5B9E;&#x73B0;&#x9886;&#x57DF;&#x670D;&#x52A1;</span>
        }
        <span class="hljs-keyword">namespace</span> application {
          <span class="hljs-comment">// &#x8FD9;&#x91CC;&#x5B9A;&#x4E49;&#x5B9E;&#x73B0;&#x5E94;&#x7528;&#x670D;&#x52A1;</span>
        }
        <span class="hljs-keyword">namespace</span> infrastructure {
          <span class="hljs-comment">// &#x8FD9;&#x91CC;&#x5B9A;&#x4E49;&#x5B9E;&#x73B0;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5C42;&#x6BD4;&#x5982;&#x8D44;&#x6E90;&#x5E93;</span>
        }
        <span class="hljs-keyword">namespace</span> adapter {
          <span class="hljs-comment">// &#x8FD9;&#x91CC;&#x5B9A;&#x4E49;&#x5B9E;&#x73B0;&#x4E00;&#x4E9B;&#x7AEF;&#x53E3;&#x9002;&#x914D;&#x5668;</span>
        }
      }
    }
  }
}
</code></pre>
<p>&#x5982;&#x679C;&#x5728;&#x6218;&#x7565;&#x5EFA;&#x6A21;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x6709;&#x4E00;&#x4E9B;&#x6982;&#x5FF5;&#x6CA1;&#x529E;&#x6CD5;&#x5F88;&#x597D;&#x7684;&#x5206;&#x79BB;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x4EE5;&#x5148;&#x653E;&#x5728;&#x4E00;&#x8D77;&#x5E76;&#x901A;&#x8FC7;&#x6A21;&#x5757;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5212;&#x5206;&#x3002;</p>
<h4 id="&#x8D44;&#x6E90;&#x5E93;repository">&#x8D44;&#x6E90;&#x5E93;(Repository)</h4>
<p>&#x8D44;&#x6E90;&#x5E93;&#x5BF9;&#x4E8E;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x6765;&#x8BF4;&#x53EF;&#x4EE5;&#x62BD;&#x8C61;&#x7406;&#x89E3;&#x4E3A;&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x5B58;&#x653E;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#x7684;&#x533A;&#x57DF;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x805A;&#x5408;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8D44;&#x6E90;&#x5E93;&#x6301;&#x4E45;&#x5316;&#x4EE5;&#x53CA;&#x4ECE;&#x8D44;&#x6E90;&#x5E93;&#x83B7;&#x53D6;&#x805A;&#x5408;&#x3002;</p>
<p>&#x901A;&#x5E38;&#x6765;&#x8BF4;&#xFF0C;&#x6BCF;&#x4E00;&#x79CD;&#x805A;&#x5408;&#x90FD;&#x5C06;&#x62E5;&#x6709;&#x4E00;&#x4E2A;&#x8D44;&#x6E90;&#x5E93;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4E00;&#x5BF9;&#x4E00;&#x7684;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x4E00;&#x4E2A;&#x8D44;&#x6E90;&#x5E93;&#x4F1A;&#x5728;<code>&#x9886;&#x57DF;&#x6A21;&#x578B;&#x5C42;</code>&#x5B9A;&#x4E49;&#x76F8;&#x5173;&#x63A5;&#x53E3;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5C42;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x63A5;&#x53E3;&#xFF0C;&#x7531;&#x4E8E;&#x805A;&#x5408;&#x662F;&#x6709;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x8D44;&#x6E90;&#x5E93;&#x63A5;&#x53E3;&#x8BBE;&#x8BA1;&#x4E00;&#x822C;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;</p>
<pre><code class="lang-cpp"><span class="hljs-keyword">class</span> SomeAggregateRepository {
<span class="hljs-keyword">public</span>:
    <span class="hljs-function">SomeAggregate <span class="hljs-title">FindSomeAggregateOfId</span><span class="hljs-params">(SomeAggregateId id)</span></span>;
    <span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">SaveSomeAggregate</span><span class="hljs-params">(<span class="hljs-keyword">const</span> SomeAggregate &amp;agg)</span></span>;
};
</code></pre>
<p>&#x5728;&#x4E0A;&#x9762;&#x7684;<code>SaveSomeAggregate</code>&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x6570;&#x636E;&#x5E93;&#x6570;&#x636E;&#x7684;&#x521B;&#x5EFA;&#x6216;&#x8005;&#x4FEE;&#x6539;&#x3002;</p>
<p>&#x8D44;&#x6E90;&#x5E93;&#x901A;&#x8FC7;&#x4F9D;&#x8D56;&#x6CE8;&#x5165;&#x7684;&#x65B9;&#x5F0F;&#x6CE8;&#x5165;&#x9886;&#x57DF;&#x5C42;&#xFF0C;&#x8FD9;&#x6837;&#x4E5F;&#x6BD4;&#x8F83;&#x65B9;&#x4FBF;&#x8FDB;&#x884C;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x3002;</p>
<h4 id="&#x96C6;&#x6210;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;">&#x96C6;&#x6210;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;</h4>
<p>&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x4F1A;&#x5B58;&#x5728;&#x591A;&#x4E2A;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#xFF0C;&#x8FD9;&#x4E2A;&#x4F1A;&#x4F53;&#x73B0;&#x5728;&#x6218;&#x7565;&#x5EFA;&#x6A21;&#x4E2D;&#x7684;<code>&#x4E0A;&#x4E0B;&#x6587;&#x6620;&#x5C04;&#x56FE;</code>&#x3002;&#x800C;&#x4E3A;&#x4E86;&#x5B8C;&#x6574;&#x6574;&#x4E2A;&#x9879;&#x76EE;&#xFF0C;&#x9700;&#x8981;&#x96C6;&#x6210;&#x8FD9;&#x4E9B;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x3002;</p>
<p>&#x300A;&#x5B9E;&#x73B0;&#x9886;&#x57DF;&#x9A71;&#x52A8;&#x8BBE;&#x8BA1;&#x300B;&#x4E00;&#x4E66;&#x4E2D;&#x7ED9;&#x51FA;&#x4E86;&#x591A;&#x4E2A;&#x96C6;&#x6210;&#x7684;&#x65B9;&#x5F0F;&#xFF1A;</p>
<p>&#xFF08;1&#xFF09;Integration Using RESTful Resources</p>
<p>&#x4E00;&#x4E2A;&#x4E0A;&#x4E0B;&#x6587;&#x901A;&#x8FC7;URI&#x65B9;&#x5F0F;&#x63D0;&#x4F9B;REST&#x8D44;&#x6E90;&#xFF0C;&#x800C;&#x5BA2;&#x6237;&#x7AEF;&#x5219;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x9632;&#x8150;&#x5C42;&#x6765;&#x8BBF;&#x95EE;&#x8FD9;&#x4E9B;&#x8D44;&#x6E90;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E0B;&#x56FE;&#xFF1A;</p>
<p><img src="images/ohs-of-the-identity-access-context.PNG" alt=""></p>
<p>&#x901A;&#x8FC7;&#x9632;&#x8150;&#x5C42;&#x5C06;&#x4F9D;&#x8D56;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x6982;&#x5FF5;&#x7FFB;&#x8BD1;&#x6210;&#x672C;&#x5730;&#x7684;<code>&#x503C;&#x5BF9;&#x8C61;</code>&#x3002;</p>
<p>&#xFF08;2&#xFF09;Integration Using Messaging</p>
<p>&#x901A;&#x8FC7;&#x9886;&#x57DF;&#x4E8B;&#x4EF6;&#x6765;&#x96C6;&#x6210;&#xFF0C;&#x8BE5;&#x65B9;&#x5F0F;&#x53EF;&#x4EE5;&#x589E;&#x5F3A;&#x7CFB;&#x7EDF;&#x81EA;&#x6D3D;&#x6027;&#x3002;</p>
<h4 id="&#x8FDB;&#x4E00;&#x6B65;&#x4E86;&#x89E3;">&#x8FDB;&#x4E00;&#x6B65;&#x4E86;&#x89E3;</h4>
<ul>
<li>Groovy</li>
<li>Grails</li>
<li>Ruby on Rails</li>
<li>Apache Commons</li>
<li>Riak</li>
<li>MongoDB</li>
<li>Qi4j</li>
<li>ActiveMQ</li>
<li>RabbitMQ</li>
<li>Akka</li>
<li>NserviceBus</li>
<li>MassTransit</li>
<li>Life beyond Distributed Transactions: an Apostate&apos;s Opinion </li>
</ul>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; hsuloong.github.io 2021 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x7F16;&#x8F91;&#x4E8E;&#xFF1A;
2021-08-11 17:29:29
</span></footer>
<script>console.log("plugin-popup....");document.onclick = function(e){ e.target.tagName === "IMG" && window.open(e.target.src,e.target.src)}</script><style>img{cursor:pointer}</style>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="architecture.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 架构设计">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"战术建模","level":"1.2.4","depth":2,"previous":{"title":"架构设计","level":"1.2.3","depth":2,"path":"domain-driven-design/notes/architecture.md","ref":"domain-driven-design/notes/architecture.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["-lunr","-search","search-pro","expandable-chapters","splitter","back-to-top-button","-sharing","sharing-plus","tbfed-pagefooter","popup"],"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy hsuloong.github.io 2021","modify_label":"编辑于：","modify_format":"YYYY-MM-DD HH:mm:ss"},"splitter":{},"search-pro":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"popup":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"back-to-top-button":{},"sharing":{"qq":true,"all":["douban","facebook","google","instapaper","linkedin","twitter","weibo","messenger","qq","qzone","viber","whatsapp"],"douban":true,"facebook":true,"weibo":true,"twitter":true,"pocket":true,"google":true,"qzone":true},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"expandable-chapters":{}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"domain-driven-design/notes/tactical-modeling.md","mtime":"2021-08-11T17:29:29.301Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-08-11T17:30:14.830Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

